[
    {
      "id": 1,
      "name": "Andhra Pradesh",
      "temples": [
        { 
          "t_id": 101, 
          "name": "Ahobilam",
          "text": "Ahobilam is a town and holy site in the Allagadda mandal of Nandyal district in the Indian state of Andhra Pradesh.It is surrounded by the Eastern Ghats with several mountain hills and gorges. It is the centre of worship of Narasimha, the lion-headed avatar of Vishnu, along with his consort Pratyangira, an avatar of Lakshmi. It is one of the nine Hindu temples and shrines dedicated to this deity. The main village and a temple complex are at Lower Ahobilam. Upper Ahobilam, about 8 kilometres to the east, has more temples in a steep gorge.The site has evidence of historical patronage from a number of regional dynasties, with the most significant being that of the Vijayanagara Kingdom.",
          "history":"The history of Ahobilam before the 16th century is obscure. One of the earliest literary references to Ahobilam is in the 9th-century Tamil-language religious work Periyatirumoḻi written by Thirumangai Alvar, where it is eulogized; this led to it being codified as one of the 108 canonical Divya Desams. Ahobilam finds subsequent mention in several Sanskrit and Telugu-language texts between the 12th and 16th centuries.",
          "iframeURL": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d123256.8854914578!2d78.62329823578011!3d15.115577232983814!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb4f4cf76edfb4b%3A0xb9b938e973f80428!2sAhobilam%2C%20Andhra%20Pradesh!5e0!3m2!1sen!2sin!4v1742047475199!5m2!1sen!2sin",
          "district": "Nandyal",
          "website": "https://ahobilamtemple.com/ahobilam/",
          "image":"/101.jpeg",
          "state": "Andhra Pradesh",
          "country": "India"
        },
        { 
          "t_id": 102, 
          "name": "Alipiri",
          "text": "Alipiri Padala Mandapam or Alipiri is the place at the foot of seven hills in Tirupati, near the Tirumala Venkateswara Temple, in the state of Andhra Pradesh, India. It is a neighbourhood of Tirupati city.Alipiri is one of two pathways to reach Tirumala on foot,[1] and it was, until recently, the only one being used in modern times. Srivari Mettu, about 2 km away, is the original one that was renovated and brought back in to use in 2008. Alipiri is the longer route with 3550 steps (over 9 km),whereas Srivari Mettu is shorter with 2388 steps (spanning about 2 km).",
          "history":"A long time ago, pilgrims used to climb all Seven Hills through the stepped way on foot because there were no other options. Pilgrims would visit from far away, cook and eat there and rest for some time. After resting, they would start to climb the steps.Now the entire stepped way is covered with a roof to protect pilgrims from sunlight and rain. Lights are also provided. Special privilege is provided to the pilgrims who came on foot to visit the Lord. ",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d62030.16548336121!2d79.29354962167967!3d13.664735199999994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb2b57034ed9943%3A0x806b87f63f941687!2sAlipiri%20Arch%20(Foot%20Road%20Start)!5e0!3m2!1sen!2sin!4v1742134261625!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.tirumala.org/",
          "image":"/102.jpg",
          "state":"Andhra Pradesh",
          "country":"India"

        },
        { 
          "t_id": 103, 
          "name": "Amararamam",
          "text": "Amararamam is a Hindu temple dedicated to Lord Siva, located in Amaravathi of Palnadu district in the Indian state of Andhra Pradesh. It is one of the five sacred Pancharama Kshetras and is unique for being situated on the Krishna River, unlike the others in the Godavari region. The temple enshrines a 15-foot white marble Sivalinga, and daily rituals are performed by priests on a platform. The main deity, Lord Amareswara (also known as Amaralingeswara), is accompanied by his consort, Bala Chamundika.",
          "history":"The Amareswara temple is believed to have been constructed in the 11th century, based on epigraphical evidence. However, its architectural style closely resembles the Bhimeswara temples of Samalkot and Draksharama, which date back to the 10th century. Among the 35 inscriptions found on the temple's walls, the earliest dates to 1129 CE. Legends associated with the Bhimeswara temples may have contributed to the temple's connections with them. Additionally, one of the earliest recorded inscriptions in the temple region is an Eastern Chalukya epigraph found at Dharanikota, near Amaravati.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3823.906999384904!2d80.3565422751469!3d16.581188284174985!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a35915a0d38b153%3A0xb0ff91e903855a33!2sSri%20Amareswara%20Swamy%20Vari%20Devasthanam!5e0!3m2!1sen!2sin!4v1742135080147!5m2!1sen!2sin",
          "district":"Palnadu",
          "website":"https://ashtavinayaktemples.com/article/id/8457/temple/457/amareshwara-swamy-temple-amararamam",
          "image":"/103.jpg",
          "state":"Andhra Pradesh",
          "country":"India"

        },
        { 
          "t_id": 104, 
          "name": "Satyanarayana Temple, Annavaram",
          "text": "Sri Veera Venkata Satyanarayana Swamy Temple is a Hindu-Vaishnavite temple located in Annavaram in Kakinada district of Andhra Pradesh, India. Dedicated to Lord Satyanarayana Swamy, an incarnation of Lord Vishnu, the temple is situated on Ratnagiri Hill. It is one of the most visited religious sites in Andhra Pradesh and is recognized as one of the state's wealthiest temples. The temple holds significant importance as a major pilgrimage centre and is regarded by many as the second most prominent in the state after the Tirumala Venkateswara Temple.",
          "history":"The temple's origins are linked to a vision experienced by a devout Brahmin named Eeranki Prakasa Rao (ఈరంకి ప్రకాశరావు), who lived in the village of Annavaram, located near Pithapuram. During the period of Raja Inuganti Venkata Ramarayanim Bahadur (రాజా ఇనుగంటి వేంకటరామరాయణిం బహదూర్), both Prakasa Rao and the local ruler had a simultaneous dream in which Lord Vishnu instructed them, On the forthcoming Sravana Sukla Vidiya, under the Makha Nakshatra on a Thursday, I will manifest on the Ratnagiri Hill. You shall install my idol as per the sacred rituals and serve me.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3809.6675529726062!2d82.39984637516255!3d17.28331138358626!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a39ce2faaaaaaab%3A0x535fff3025651d88!2sSri%20Veera%20Venkata%20Sathyanarayana%20Swamy%20Vari%20Devasthanam%20Annavaram!5e0!3m2!1sen!2sin!4v1742135607010!5m2!1sen!2sin",
          "district":"Kakinada",
          "website":"https://annavaramdevasthanam.nic.in/",
          "image":"/104.jpg",
          "state":"Andhra Pradesh",
          "country":"India"

        },
        { 
          "t_id": 105, 
          "name": "Bhavanarayana Temple, Sarpavaram",
          "text": "Sri Bhavanarayana Swamy Temple is a historic Hindu temple dedicated to Lord Vishnu, located in Sarpavaram, approximately 5 km from Kakinada in Andhra Pradesh, India. The temple is recognized as one of the State Protected Monuments by the Archaeological Survey of India (ASI) in Andhra Pradesh and is renowned for its religious significance and historical inscriptions.",
          "history":"The Bhavanarayana Temple holds historical and architectural importance, reflecting the contributions and patronage of various dynasties over centuries. Inscriptions found in the temple provide evidence of contributions by Eastern Chalukyan kings, Chola King Kulottunga, and Kataya Vema Reddi (1414 CE) of the Reddi Kingdom. Over centuries, the temple underwent repairs and reconstructions, reflecting the patronage of successive rulers.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1953514.2481509992!2d80.90000212499999!3d17.001214100000027!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3829d4c3a8f739%3A0xd9436267792aa51a!2sSri%20Bhavannarayana%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742136129519!5m2!1sen!2sin",
          "district":"Kakinada",
          "website":"https://eastgodavari.ap.gov.in/temples/sri-bhavanarayana-swamy-temple-sarpavaram/",
          "image":"/105.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 106, 
          "name": "Bugga Ramalingeswara Swamy Temple, Tadipatri",
          "text": "Bugga Ramalingeswara Swamy temple is a Siva shrine situated on the southern bank of the Penna river in Tadipatri, Anantapur district of Andhra Pradesh, India. It was built between 1490 and 1509 by Pemmasani Ramalinga Nayudu I, a chieftain of the Gutti-Gandikota region during the reign of the Vijayanagara Empire.",
          "history":"Bugga Ramalingeswara Swamy temple is 4 km (2.5 mi) from Tadipatri railway station. It was likely built between 1490 and 1509 during the reign of the Vijayanagara Empire. As per the Tadipatri kaifiyat collected by Colin Mackenzie in 1802, the temple was built by Ramalinga Nayudu, a chieftain of the Gutti-Gandikota region in Vijayanagara Empire.",
          "iframeURL": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3855.33641827713!2d78.00754467511234!3d14.918338985606576!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb41ca49232fe7b%3A0x8f63031732a1c7a6!2sShri%20Bugga%20Ramalingeshwara%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742136603893!5m2!1sen!2sin",
          "district":"Anantapur",
          "website":"https://www.trawell.in/andhra/anantapur/bugga-ramalingeswara-swamy-temple-tadipatri",
          "image":"/106.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 107, 
          "name": "Chintalarayaswamy Temple",
          "text": "Chintalarayaswamy Temple or Sri Chintala Venkataramana Temple is a Hindu Vaishnavite temple situated at Tadipatri, a town in the Anantapur District of Andhra Pradesh, India. The Temple is dedicated to Venkateswara, a form of Vishnu, who is referred to as Chintala Venkataramana. The temple was built by Pemmasani Timmanayudu II of the Pemmasani Nayaks. It is situated on the bank of the Penna River, which passes through the town. The temple has granite sculptures and is classified as one of the Monuments of National Importance by Archaeological Survey of India (ASI). The temple has a Garuda Mandapa built as chariot with rotating granite wheels, which is similar to the one found in the Vithala Temple of Hampi.",
          "history":"The Temple was built during the reign of Vijayanagara empire in mid 16th Century by Pemmasani Timmanayudu II, a contemporary of Vira Narasimharaya and Krishnadevaraya. Timmanayudu built this temple after Vishnu is said to have told Timmanayudu in a dream that a temple should be constructed for him at Tadipatri. Timmanayudu appointed two archakas and a chief-priest, and he gifted lands to the temple. The Chintalarayaswamy Temple is considered one of the finest examples of Vijayanagara architecture. The initial structure may belong to the Saluva dynasty, but the entrance towers belongs to the Tuluva dynasty.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3855.4634202245825!2d78.00794597511225!3d14.911252985612716!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb41cafac551c1f%3A0x6299698b2b9cddf2!2sSri%20Chintala%20Venkataramana%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742136894638!5m2!1sen!2sin",
          "district":"Anantapur District",
          "website":"https://thetempleguru.com/listing/chintala-venkataramana-temple-tadipatri/",
          "image":"/107.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 108, 
          "name": "Draksharamam",
          "text": "Draksharamam or Daksharamam is one of the five Pancharama Kshetras that are sacred to the Hindu god Shiva and also 12th of Ashtadasha Shakthi Peetams. The temple is located in Draksharamam town of Konaseema district in the Indian state of Andhra Pradesh. The poet Mallikarjuna Panditaradhyudu who wrote first independent work in Telugu and who spread Lingayatism in Andhra region during medieval ages was born in this town.",
          "history":"Inscriptions in the temple reveal that it was built between the 9th and 10th centuries CE by the Eastern Chalukyan king, Bhima. The big Mandapam of the temple was built by Ganga Mahadevi, daughter-in-law of Eastern Ganga Dynasty king Narasingha Deva I of Odisha.Architecturally and sculpturally, the temple reflects a blend of Chalukyan and Chola styles.The temple is historically prominent. It was built by Eastern Chalukyas who reigned over this area. It's believed to have been constructed earlier to the Bhimeswaraswamy temple in Samarlakota that was built between 892 C.E. and 922 C.E.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d30557.939301252645!2d82.04242801603844!3d16.78948632593167!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a378d6bc177bf05%3A0x5503fb55eac90664!2sDraksharamam%2C%20Andhra%20Pradesh%20533262!5e0!3m2!1sen!2sin!4v1742137921416!5m2!1sen!2sin",
          "district":"Konaseema",
          "website":"https://eastgodavari.ap.gov.in/temples/lord-bhimeswara-swami-temple-draksharama/",
          "image":"/108.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 109, 
          "name": "Govindaraja Temple, Tirupati",
          "text": "Sri Govindarajaswamy Temple is an ancient Hindu Vaishnavite temple situated in the heart of Tirupati city in Tirupati district of Andhra Pradesh in India. The temple was built during 12th century and was consecrated in the year 1130 AD by Ramanuja by the Thenkalai Vaikhanasa traditions. The temple is one of the earliest structures in Tirupati and also one of the biggest temple complexes in the district. The Tirupati (down hill) city is built around this temple. The temple is currently administered by Tirumala Tirupati Devasthanams.",
          "history":"Govindaraja Temple was consecrated in the year 1130 AD by saint Ramanuja. However, there are structures inside the temple complex which belong to 9th and 10th centuries. Before Govindaraja was consecrated as the presiding deity, another form of Vishnu - Parthasarathy enjoyed that honour. Kotturu, a village at the foot of Tirumala hills, was moved to the vicinity of Govindaraja Temple which was later merged into city of Tirupati.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15509.828065827995!2d79.39827515541988!3d13.629941000000011!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb2ca9d49b3b457%3A0xbeb2c75f1497a9e7!2sSri%20Govindaraja%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742138287174!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.tirumala.org/TemplesAtTirupathi.aspx",
          "image":"/109.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 110, 
          "name": "Kalyana Venkateswara Temple, Narayanavanam",
          "text": "Sri Kalyana Venkateswara Swamy Temple is a Hindu temple situated at Narayanavanam, a town in Tirupati district of Andhra Pradesh state, India. The Temple is dedicated to Kalyana Venkateswara, a form of Vishnu. The temple is situated at 2 km east of Puttur and 45 km south of Tirupati. It is believed that Venkateswara married his consort Padmavathi at this place and then moved to Tirumala.",
          "history":"The temple was established in the year 1541 AD. It was extended in later times.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3880.8002275593158!2d79.58628967508436!3d13.424689286933887!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d5b802cf6707f%3A0x59c62219c20ec677!2sSri%20Kalyana%20Venkateshwara%20Swamy%20Temple%20Narayanavanam!5e0!3m2!1sen!2sin!4v1742139219855!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.trawell.in/andhra/tirupati/narayanavanam",
          "image":"/110.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 111, 
          "name": "Kalyana Venkateswara Temple, Srinivasamangapuram",
          "text": "Kalyana Venkateswara Temple is an ancient Hindu temple at Srinivasamangapuram in Tirupati. It is located in Tirupati District of Andhra Pradesh, India. The temple is dedicated to the god Venkateswara, a form of Vishnu and is referred to as Kalyana Venkateswara. The temple is one of the centrally protected monuments of national importance.",
          "history":"The temple was under the control of the ASI from 1967 to 1981. In 1981 the temple was handed over to Tirumala Tirupati Devasthanams. At present the temple is being administered by Tirumala Tirupati Devasthanams (TTD).",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15511.06896742567!2d79.31000205541989!3d13.611023000000005!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d4be0b9d13e8d%3A0xed3696b0f75fcacb!2sSRI%20KALYANA%20VENKATESWARA%20SWAMY%20TEMPLE!5e0!3m2!1sen!2sin!4v1742140519375!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://jyotirlingatemples.com/article/id/116/temple/19/sri-kalyana-venkateswara-swamy-temple-srinivasa-mangapuram",
          "image":"/111.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 112, 
          "name": "Kanaka Durga Temple, Vijayawada",
          "text": "Kanaka Durga Temple, officially known as Sri Durga Malleswara Swamyvarla Devasthanam, is a Hindu temple dedicated to Kanaka Durga. The deity in this temple is also popularly referred as Kanaka Durga. The temple is located in Vijayawada, Andhra Pradesh, India on the Indrakeeladri hill on the banks of Krishna River. Kaalika Purana, Durgaa Sapthashati and other Vedic literature have mentioned about Kanaka Durga on the Indrakeelaadri and have described the deity as Swayambhu, (self-manifested) in Triteeya Kalpa.",
          "history":"According to legend, goddess Durga killed demon Mahishasura and enshrined on the Keela Mountain with eight arms in the form of Mahishasura Mardini as she had given boon to Keela. Indra and all other gods worshipped the goddess Kanaka Durga on the hill which later known as Indrakeeladri. In Dwaapara Yuga, Arjuna did great penance on Indrakeeladri for Lord Shiva in order to get the most powerful Astra called Paashupataastra. Later, Lord Shiva appeared to fulfill the desire of Arjuna and called him as Vijaya (victorious). The place came to be known as Vijayawada after Arjuna's victory.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3825.227974916822!2d80.60317832514545!3d16.514584484231342!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a35ef60fc8a57d7%3A0x72e7d9efd9746342!2sVijayawada%20Sri%20kanaka%20durga%20temple%20Main%20gopuram!5e0!3m2!1sen!2sin!4v1742191637777!5m2!1sen!2sin",
          "district":"NTR",
          "website":"https://www.yatra.com/utilities/temple/kanaka-durga-temple-vijayawada",
          "image":"/112.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 113, 
          "name": "Kapila Theertham",
          "text": "Kapila Theertham is a small Shaivite temple and theertham, located at Tirupati in Andhra Pradesh, India. The idol of Shiva is believed to have been installed by Kapila, so Shiva here is referred to as Kapileswara.The temple stands at the entrance to a mountain cave in one of the steep and vertical faces at the foot of the Tirumala hills, which are part of Seshachalam Hills, where the waters of the mountain stream fall directly into a temple tank.At the temple entrance is a stone statue of Nandi, Shiva's bull mount.",
          "history":"The temple received very good patronage from the rulers of Vijayanagara in the 13th thru 16th centuries, especially Saluva Narasimha Deva Raya, and the well known Sri Krishna Deva Raya, and some of the later rulers like Venkatapathi Raya, and Aliya Ramaraya, Sri Krishna Deva Raya's son-in-law.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15508.088475902574!2d79.40297075541994!3d13.656418400000016!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d4af6c191fefd%3A0xe24954a4401cc9e5!2sKapila%20Teertham%20Waterfalls!5e0!3m2!1sen!2sin!4v1742192219877!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.trawell.in/andhra/tirupati/kapila-theertham",
          "image":"/113.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 114, 
          "name": "Kodandarama Temple, Tirupati",
          "text": "Sri Kodandaramaswamy Temple is a well known temple in the city of Tirupati located in Tirupati district of Andhra Pradesh, India. The temple is dedicated to Hindu deity Rama, an incarnation of Vishnu along with Sita and Lakshmana. The temple also has a sub-shrine for Rama's mount Anjaneya.",
          "history":"According to Varaha Purana, during Treta Yuga, Lord Sri Rama resided here along with Sita Devi and Lakshmana on his return from Lankapuri. It was built by a Cholas during the tenth century AD.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3877.3787130423643!2d79.41303512508811!3d13.634711986745032!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d4bf69b0b274d%3A0xfc891d8ca0bcf881!2sSri%20Kodanda%20Rama%20Swami%20Temple!5e0!3m2!1sen!2sin!4v1742192518335!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.trawell.in/andhra/tirupati/kodandarama-swami-temple",
          "image":"/114.jpeg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 115, 
          "name": "Konetirayala Temple, Keelapatla",
          "text": "Konetirayala Swamy Temple (also known as Venkateswara Temple) is a Hindu temple of Lord Venkateswara in the town of Keelapatla, Palamaner, Chittoor District, Andhra Pradesh, India. It is believed that Lord Venkateswara first placed his Holy Foot here at Keelapatla and then reached Tirumala.",
          "history":"History says some of the rulers who ruled this place were, Sathavahans, Pallavas, Renuti Cholas, Rastrakootas, Banus, Chalukyas, Pandyas, Yadava Kings, Vijayanagar Emperors, Matli Kings, Moghul Kings, Arcot Nawabs, Tippu Sultan, Britishers and Palegars. The 15th-century Hindu saint, Andhra Pada kavitā Pitāmaha, Annamacharya mentions the name of Konetiraya in many of his sankeerthanas. In past the temple was developed by Punganuru 'Jamindars', They were coming to the temple by punganoru-kallupalli-malleru-melumoi-kothapalli-keelapatla wise road.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3883.799229298883!2d78.77035457508109!3d13.237912787102438!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bad7c48ad719be3%3A0x70c48958dd960538!2sSri%20Konetiraya%20Svami%20Temple!5e0!3m2!1sen!2sin!4v1742199879308!5m2!1sen!2sin",
          "district":"Chittoor",
          "website":"https://www.templepurohit.com/hindu-temple/koneti-rayala-swamy-temple-chittoor-district/",
          "image":"/115.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 116, 
          "name": "Kotappakonda",
          "text": "Kotappakonda also known as Kotappakonda Sri Trikoteswara Swami Temple is a holy hill, situated in Palnadu district, Andhra Pradesh, India. It is located 10 kilometers from Narasaraopet, 20 kilometers from Chilakaluripet town and 62 kilometers south west of Guntur City.",
          "history":"According to the inscriptions, the temple was in existence even before 1172 A.D. Among several kings who ruled the place Sri Krishna Deva Raya gifted large chunks of lands for the maintenance of the temple. The Zamindars of Narsaraopet Chilakuripet, Amaravathi and several others, have donated liberally for the development of the temple. The height of the Kotappa Konda or Kotappa hill is 1587 feet and the Temple of Sri Trikoteswara Swamy is at the height of 600 feet.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3832.4244130485363!2d80.03265517513755!3d16.147049284543797!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4a87f82a1e3943%3A0x15565c7c72a4fe00!2sKotappakonda%20Sri%20Trikoteswara%20Swami%20Temple!5e0!3m2!1sen!2sin!4v1742200233260!5m2!1sen!2sin",
          "district":"Palnadu",
          "website":"https://www.bookmydarshan.in/temples/kotappakonda-sri-trikoteswara-swami-temple",
          "image":"/116.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 117, 
          "name": "Ksheerarama",
          "text": "Ksheerarama is one of the five Pancharama Kshetras that are sacred to the Hindu god Shiva. The temple is located in Palakollu of West Godavari in the Indian state of Andhra Pradesh. Shiva is known locally as Ksheera Ramalingeswara Swamy. It is believed that staying one day in Kshirarama is equivalent to staying one year in Varanasi.[clarification needed] It is one of the centrally protected monuments of national importance.",
          "history":"The Prakara was designed by Sri Velupathi during the 10th century. The construction technique resembles those built during the Chalukya Agnikuls period. Gopuram was constructed under the direction of sri Alladu Reddy during the 14th century. During the 17th century, Kalyana mantapam (choultry) and Ashtha Bhuja Lakshmi Narayanaswamy alaya were constructed.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3825.182947251209!2d81.72527377514547!3d16.516859084229406!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a37daf96ba2d4f9%3A0x54e959a0e3bd6992!2sKsheera%20RamaLingeswara%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742200502643!5m2!1sen!2sin",
          "district":"West Godavari",
          "website":"https://www.trawell.in/andhra/rajahmundry/sri-ksheera-rama-temple-palakollu",
          "image":"/117.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 118, 
          "name": "Kulandeshwara Temple",
          "text": "Kulandeshwara Temple, located in the Chittoor district of Andhra Pradesh, India. It is dedicated to the deity Kulandeshwara (the Hindu god Shiva). It dates back to the 11th century. It is located in Kattamanchi. Chola Period.",
          "history":"The temple’s history is intertwined with Hindu mythology. It is said that Lord Subramanya chose this location as his residence after defeating the demon Tarakasura. The site is also linked to the Ramayana epic, with claims that Lord Rama and Lakshmana visited during their exile.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3948175.053421701!2d77.99378653293982!3d14.901412066242022!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a37f70e002540c9%3A0xb8675c02d7f60052!2sSri%20Kundaleswara%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742200892477!5m2!1sen!2sin",
          "district":"Chittoor",
          "website":"https://templeyatri.in/kulandeshwara-temple/",
          "image":"/118.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 119, 
          "name": "Kumararama",
          "text": "Kumararama, also known as the Chalukya Bhimeswara Temple, is a historic Hindu temple located in Samalkota in the Kakinada district of Andhra Pradesh, India. Dedicated to Lord Siva, it is one of the five Pancharama Kshetras, revered pilgrimage sites in the state. The temple is renowned for housing a 14-foot tall white crystal Siva Linga, which spans two floors, believed to have been consecrated by Lord Kumara Swamy himself, giving the temple its name.",
          "history":"The Chalukya Bhimeswara Temple is traditionally believed to have been established during the reign of Chalukya Bhima I (ruled 892–922 CE), the ruler of the Eastern Chalukyas.[1] Epigraphical evidence, including an inscription at Pithapuram, supports the identification of Chalukya Bhima as the founder of the temple. The inscription mentions that Chalukya Bhima constructed a shrine dedicated to Lord Siva near Samalkot in Kakinada District. The inscription describes his victories in numerous battles and his 30-year reign.[",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3814.620795556455!2d82.16865077515712!3d17.04226058378723!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3786d57dd084fd%3A0x96af8024102a7d65!2sSri%20Chalukya%20Kumararama%20Bhimeswara%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742201174891!5m2!1sen!2sin",
          "district":"Kakinada",
          "website":"https://eastgodavari.ap.gov.in/temples/sri-chalukya-kumararama-sri-bhimeswaraswamy-vari-temple-samalkot/",
          "image":"/119.jpg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 120, 
          "name": "Kurmanathaswamy temple, Srikurmam",
          "text": "The Kurmanathaswamy temple, also known as the Kurmanatha temple, Srikurma or Srikurmam temple, is a Hindu temple dedicated to Kurma – the second avatar of Vishnu. It is located in Srikurmam village, Srikakulam district in Andhra Pradesh, India. According to Prapannamrutam and earliest inscription of the temple, In saka 1035 CE Anantavarman Chodaganga Deva of Eastern Ganga Dynasty of Odisha converted this temple to a Vaishnava khetra from a Siva temple.The temple was Built before 11th-century CE in a fusion architecture of kalinga Architecture and Dravidian Architecture.",
          "history":"The temple is situated in the Gara mandal of the Srikakulam district, which is located at a distance of 130 kilometres (81 mi) from Visakhapatnam. It is one of the Indian temples where the Hindu deity Vishnu is worshipped in the form of a tortoise (the others being Sri Gaviranganatha Swami temple at Gavirangapura, Chitradurga, Karnataka and Sri Kurma Varadaraja Swami temple at Kurmai, Chittoor, Andhra Pradesh). Srikurmam is 15 kilometres (9.3 mi) away from Srikakulam town and 12.5 kilometres (7.8 mi) away from the Suryanarayana temple, Arasavalli. Inscriptional history of the temple begins in the 11th-12th centuries. The temple is popular among the Tamil diaspora as well because it is a Vaishnavite temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3788.6908775306147!2d84.0039686751856!3d18.26998708277565!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3c3ecf8048dd1b%3A0x9f038b3f8c72bff2!2sSri%20Kurmanatha%20Swamy%20temple!5e0!3m2!1sen!2sin!4v1742201713817!5m2!1sen!2sin",
          "district":"Srikakulam",
          "website":"https://bhaktikalpa.com/special_temple_details.aspx?id=4106",
          "image":"/120.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 121, 
          "name": "Lakshmi Narasimha swamy temple, Penna Ahobilam",
          "text": "The Lakshmi Narasimha Swamy temple is located on the banks of Pennar river in Penna Ahobilam, Anantapur District of Andhra Pradesh, India.The Lakshmi Narasimha Swamy temple is located in Anantapur district of Andhra Pradesh, India. It is located 220 km from Nandyal and about 185 km from Kurnool, the district headquarters, 41 km from Anantapur and is 12 km away from Uravakonda.One of temples of Lakshmi narasimha swamy is also at Somaghatta village, Gorantla, Anantapur.",
          "history":"The temple was built on the footprint of Lord Lakshmi Narasimha Swamy measuring 5 feet 3 inches. Temple times are 6.00am to 12.30pm and 2.00pm to 7.00pm.The temple is a popular location for marriage ceremonies. A grand car festival is conducted annually in the month of April.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3856.374846772735!2d77.30410577511122!3d14.860303585657368!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb6d0a1a786754d%3A0xb0b0291f8785bbfe!2sLakshmi%20Narasimha%20Swamy%20Temple%2C%20Penna%20Ahobilam!5e0!3m2!1sen!2sin!4v1742221187161!5m2!1sen!2sin" ,
          "district":"Anantapur",
          "website":"https://www.holidify.com/places/anantapur/penna-ahobilam-sightseeing-4064.html",
          "image":"/121.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 122, 
          "name": "Lakshmi Narasimha Temple, Antarvedi",
          "text": "Lakshmi Narasimha Temple is situated in temple town named Antarvedi of Sakhinetipalle Mandal, located in the Konaseema district of the Andhra Pradesh state in India. The temple is situated at the place where the Bay of Bengal and Vashista Godavari, a tributary of the Godavari River, meet. It was built in the 15th and 16th centuries.",
          "history":"[edit source] Antarvedi, in terms of geographical surface area, covers about 4 square miles (6.4 km). The village contains the widely revered Lord Sri Lakshminarasimha Swamy temple built by Kopanathi krishnamma (Belongs to Agnikula Kshatriya), located opposite Vasishta Godavari. A launch pad allows visitors to land on the small island at the other side of the Godavari River - from this point, travel can then be undertaken to the convergence point of the river and the ocean.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3828.7797878543074!2d81.73099167514155!3d16.33419238438436!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4827a84b4d0967%3A0xa21a9c040cb84f3a!2sSri%20Lakshmi%20Narasimha%20Swamy%20Vari%20Devasthanam!5e0!3m2!1sen!2sin!4v1742221880832!5m2!1sen!2sin",
          "district":"Konaseema",
          "website":"https://eastgodavari.ap.gov.in/temples/sri-lakshmi-narasimha-swamy-temple-antharvedi/",
          "image":"/122.webp",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 123, 
          "name": "Lakshmi Narasimha Temple, Mangalagiri",
          "text": "Lakshmi Narasimha Temple is a Vaishnavite temple and one of the eight sacred places of Lord Vishnu in India. It is also known for being one of the eight mahakshetras Narasimha in India. It is situated at the foot of the Auspicious Hill in Mangalagiri which is part of the Vijayawada part of Guntur district of Andhra Pradesh, India. It is one of the temples in the series of three temples located on and at the bottom of the hill, the other two being Panakala Narasimha Temple on the hill and Gandalaya Narasimha Temple at the top of the hill. It has one of the highest gopurams in South India and only one of its type in this part of India. It is 153 feet (47 m) in height and 49 feet (15 m) wide and has eleven storeys.",
          "history":"The Lakshmi Narasimha Temple is popularly believed to have been discovered by Yudhishthira, the eldest Pandava brother. The temple's history is said to be recorded in the Brahma Vaivarta Purana, one of the old Hindu religious scriptures. This temple was patronized by the Vijayanagara rulers. There is an inscription from the time of Krishnadevaraya, who had visited the temple, at the temple site. The temple's tall eleven story gali gopuram was built by Vasireddy Venkatadri Nayudu, a zamindari patron and devotee of Narasimha.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3826.823289453062!2d80.5658031751437!3d16.433798684299823!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a35f13f279ee7b9%3A0xa17e5480990ac8df!2sSri%20Lakshmi%20Narasimha%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742222181347!5m2!1sen!2sin",
          "district":"Guntur",
          "website":"https://www.mangalagiri.org/temple.html",
          "image":"/123.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 124, 
          "name": "Mallikarjuna Temple, Srisailam",
          "text": "Sri Bhramarambika sametha Mallikarjuna swamy Devasthanam (romanised: Mallikārjunuḍu) or Srisailam Temple is a Hindu temple dedicated to the deities Shiva and Parvati, located at Srisailam in the Indian state of Andhra Pradesh. It is significant to the Hindu sects of both Shaivism and Shaktism as this temple is referred to as one of the twelve Jyotirlingas of Shiva and as one of the eighteen Shakti pithas, centres of the Hindu goddess.[1] Shiva is worshiped as Mallikarjuna and is represented by the lingam. His consort Parvati is depicted as Bhramaramba.",
          "history":"When Shiva and Parvati decided to find suitable brides for their sons. Shiva got Buddhi (intellect) and Siddhi (spiritual power) married to Ganesha. Kartikeya on his return was enraged and went away to stay alone on Mount Krauncha in Palani in the name of Kumara brahmachari. On seeing his father coming over to pacify him, he tried to move to another place, but on the request of the Devas, stayed close by. The place where Shiva and Parvati stayed came to be known as Srisailam",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3833.8368112454086!2d78.86544867513604!3d16.073955884606246!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb5656c41af32d5%3A0x1875cd84b9c2e163!2sSri%20Mallikarjuna%20Swamy%20jyotirlinga%20Temple!5e0!3m2!1sen!2sin!4v1742222392709!5m2!1sen!2sin",
          "district":"Nandyal",
          "website":"https://www.srisailadevasthanam.org/en-in/about/the-temple/srisailam-devasthanam",
          "image":"/124.png",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 125, 
          "name": "Mantralayam",
          "text": "Mantralayam is a pilgrim village in Kurnool district in Andhra Pradesh, India, on the banks of the Tungabhadra River on the border with neighbouring state of Karnataka. It is known for being the site of the samadhi of Raghavendra Tirtha, a saint who lived in the 17th century. He is believed to have chosen to be enshrined alive in a meditative state in front of his disciples at the site of the temple. Thousands of people visit the Raghavendra Math and temples on the banks of the river.",
          "history":"Sri Guru Raghavendra Swamy lived between 1601 and 1671 was an influential saint in Hinduism. He advocated Vaishnavism (i.e. worship of Vishnu as the supreme God) and also the Dvaita philosophy of Sri Madhwacharya. Followers of the saint consider him to be an incarnation of Bhakta Prahallada, who was saved by Vishnu in the avatar of Narasimha. Shri Raghavendra Swamy is said to have performed many miracles during his lifetime and has a large following even today. Mantralayam is a small and peaceful town situated on the banks of the River Tungabhadra, and gets thousands of devotees from all over the country.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d30691.024964841923!2d77.39248605827532!3d15.941618277480762!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb63b1d5068994b%3A0x55a0916ad10f9114!2sMantralayam%2C%20Andhra%20Pradesh!5e0!3m2!1sen!2sin!4v1742224055736!5m2!1sen!2sin",
          "district":"Kurnool",
          "website":"https://www.templepurohit.com/hindu-temple/mantralayam-temple-andhra-pradesh/",
          "image":"/125.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 126, 
          "name": "Chennakesava Swamy Temple, Markapur",
          "text": "Markapuram is a town in Prakasam district of the Indian state of Andhra Pradesh. It is a municipality and is the headquarters of Markapuram Municipality in Markapuram revenue division.[1][5] Markapuram is notable for the Chennakesava Swamy Temple, built by King Sri Krishnadevaraya. During Ratha Yatra (Tirunalla in Telugu) there occurs a popular carnival; the town is also famous for Chenna Kesavaswamy (Saptavahana Seva) on the day of Rathsapthami, which is attended by thousands of people coming from different parts of the state. It is the second-largest town in Prakasam district after Ongole and it is the main place within West Prakasam district to avail all facilities.",
          "history":"The town's name comes from a story of a milk maid by the name of Marika who was graced with a son by Swamy Chennakesava. The milk maid, in commemoration of this event, constructed a small temple. Soon afterwards a village grew round and about this temple and was known as Marikapuram. By afflux of time this name evolved into Markapuram. The temple, originally constructed by Marika, underwent numerous additions and renovations, the later large and prominent temple being dedicated to Sri Chennakesava.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3840.2322203609824!2d79.26907787512897!3d15.738849884893757!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb5319764300c39%3A0x94922ace6f16c1b3!2sSri%20Lakshmi%20Chennakesava%20Swami%20Devastanam!5e0!3m2!1sen!2sin!4v1742224469778!5m2!1sen!2sin",
          "district":"Prakasam",
          "website":"https://sadashree.substack.com/p/markapur-chennakesava-swamy-temple",
          "image":"/126.JPG",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 127, 
          "name": "Sri Mukhalingam, Srikakulam",
          "text": "Mukhalingam, also known as Srimukhalingam or Mukhalinga, is a village panchayat in Jalumuru mandal of Srikakulam district in the Indian state of Andhra Pradesh. Historically known as Kalinganagari, Mukhalingam served as the capital of Eastern Ganga Dynasty from 6th century AD to 12th century AD. Emperor Sri Ananthavarma Chodaganga Devara conquered Utkala in 1122 AD and shifted the capital from Kalinganagari to Caudwara kataka.",
          "history":"The temple's rich history dates back to the 8th century AD when it was built by Kāmārnava–II, son of Dānārnava of the Eastern Ganga dynasty. King Anantavarman Cōdaganga’s Korni Copper Plant Grant (1077–1147 AD) reveals that Kāmārnava, an ancestor of Cōdaganga, constructed this temple.srimukhalingam temple history, as the name suggests, features a unique Shiva Lingam with a face (Sri Mukham). The Lingam, carved from the fossilized trunk of the Madhuka tree, stands as a unique structure in India. Local lore tells that Lord Shiva manifested in this tree to relieve a group of Gandharvas cursed to live as tribes. Thus, the temple also honors Shiva as Sri Madhukeswara Swamy.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d30251.54321188826!2d83.95135541875399!3d18.59913843059669!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3c5dccf6f51f31%3A0x37ccf278094b82f3!2sMukhalingam%2C%20Andhra%20Pradesh%20532428!5e0!3m2!1sen!2sin!4v1742224923185!5m2!1sen!2sin",
          "district":"Srikakulam",
          "website":"https://travellerkaka.com/srimukhalingam-temple-the-powerful-varanasi-of-south-india/",
          "image":"/127.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 128, 
          "name": "Padmavati Temple",
          "text": "Padmavati Temple is a Hindu temple dedicated to the deity Padmavati (Alamelu Mangamma or Alarmelmangai), the consort of Venkanna.[1] The temple is situated in Tiruchanur (also known as Alamelu Mangapuram or Alarmel Mangaipuram area) of Tirupati city in Tirupati district of Andhra Pradesh, India.The temple is under the administration of Tirumala Tirupati Devasthanams and follows the pancharatra agama and vadakalai traditions.",
          "history":"The history of Sri Padmavathi Ammavari Temple dates back to the 8th century when the temple was initially built by the Pallavas. The temple was later renovated and expanded during the reign of the Vijayanagara Empire in the 14th century. The temple's architecture is a blend of Pallava, Chola and Vijayanagara styles. According to legend, Goddess Padmavathi was born as the daughter of the King of the seven hills, Akasha Raja. The goddess was said to have emerged from a lotus flower in a pond in the nearby town of Padmavathi Kshetram. She was discovered by Lord Venkateswara while he was on a hunting expedition, and they fell in love. They got married in a grand ceremony, which is believed to have taken place at this temple. Their wedding is celebrated every year in the temple during the Navaratri festival.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3787.321794007013!2d78.69609187518712!3d18.33259808272487!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bccf8fe9016dbc5%3A0xdf941d51de9ad8dc!2sSri%20Padmavati%20Goda%20sametha%20Venkateswara%20swamy%20Temple!5e0!3m2!1sen!2sin!4v1742225233799!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.rajpark.com/tirupati-hotel/blog/the-glorious-sri-padmavathi-ammavari-temple.html",
          "image":"/128.JPG",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 129, 
          "name": "Pallikondeswara Temple, Surutapalle",
          "text": "Pallikondeswara Temple(also Pradosha kshetram) is a Hindu temple dedicated to the god Shiva located in Surutupalle,[1] a village in Tirupati district of Andhra Pradesh, India. The presiding deity Pallikondeswara, unlike other Shiva temples, is sported in reclining posture lying on the lap of his consort Parvati.The temple house a three-tiered gateway tower known as gopurams. The temple has numerous shrines, with those of Valmeegeeswarar and Maragathambigai being the most prominent. ",
          "history":"The Pallikondeswara Temple, also known as Pradosha Kshetram, holds a unique place in Hindu worship as it houses a reclining deity of Lord Shiva. Unlike traditional Shiva temples, the presiding deity here, Pallikondeswara, is depicted lying on the lap of his consort Parvati. The temple’s origins trace back to the 7th century AD, with contributions from various dynasties, including the Cholas and the Vijayanagara Empire, adding to its architectural richness over the centuries.The temple’s historical significance is deeply intertwined with the socio-cultural development of the region. It attracts devotees from all corners of India, participating in annual festivals and rituals that draw large crowds, enriching the cultural tapestry of the area.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3882.253718975339!2d79.87209697508283!3d13.334487287015248!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a529d78ae4d2949%3A0x7c5d8187e936361d!2sSri%20Pallikondeswara%20Swamy%20Temple%2C%20Surutapalli!5e0!3m2!1sen!2sin!4v1742227617464!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://www.teluguone.com/devotional/amp/content/sri-pallikondeshwara-swamy-temple-65-28690.html",
          "image":"/129.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 130, 
          "name": "Prasanna Venkateswara Temple, Appalayagunta",
          "text": "Sri Prasanna Venkateswara Swamy Temple is a temple at Appalayagunta, Tirupati located in Tirupati district of Andhra Pradesh, India. The temple is dedicated to the Hindu deity Venkateswara, referred to as Prasanna Venkateswara. Unlike other typical Venkateswara temples, the presiding deity has its right hand in Abhaya posture.",
          "history":"The temple was constructed in 1232 AD by King of Karvetinagaram, Venkata Perumalaraju Brahmadeva.[",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3878.9725858869574!2d79.47501557508635!3d13.5372731868326!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d4e7118899f5d%3A0x885d588571f5f211!2sSri%20Prasanna%20Venkateswara%20Swamy%20Temple%2C%20Appalayagunta!5e0!3m2!1sen!2sin!4v1742227939153!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://touritvirtually.com/appalayagunta/",
          "image":"/130.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 131, 
          "name": "Siddeswara Kshetram",
          "text": "Siddeswara Kshetram, popularly known for 'Siddeswara Swamy Temple', is an ancient Hindu temple of Lord Siddeswara on the hilltop of Siddeswara Gutta in Gurramkonda in India. It is one of the oldest temples in Chittoor District.The sanctum sanctorum of the temple has Lord Siddeswara along with Parvathi Ammavaru and Nandi The temple is located on a hilltop.",
          "history":"Locals used to celebrate jathara at the time of shivarathri at the temple. The practice was renewed in 2013 and three new idols were placed in the temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1973870.5728713009!2d76.71410789374995!3d14.925056700000003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb4a29e712ae65d%3A0xd7f809a1bed2c222!2sSiddeswara%20Kshethralayam!5e0!3m2!1sen!2sin!4v1742228335723!5m2!1sen!2sin",
          "district":"Chittoor",
          "website":"https://spsnellore.ap.gov.in/sri-siddeswara-venugopala-swamy-temples-muthukur/",
          "image":"/113.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 132, 
          "name": "Siddeshwara Swamy Temple",
          "text": "Siddheswara Swamy Temple is a large Hindu temple located in the Indian state of Andhra Pradesh. It is located in Talakona in the Sri Venkateswara National Park of Tirupati district. The temple is located in the deep forest of the park (just 20 minutes walk from the well-known Talakona Waterfall). The main deity of the temple is Shiva and the primary festival celebrated is Maha Shivaratri. Locals also gather to celebrate Holi.",
          "history":"As per the local people, the temple was built some 140 years ago. The Shiva Linga in the temple was brought from the ruined temple of Rayavaripalli, a village in Pulicherla Mandal, On olden days there was a custom that if any new temple is constructed, instead of making a new Siva Linga, can install old one which lies without Pooja in ruined Temples. Based on this custom the Shiva Linga was brought from Rayavaripalli ruined temple. The relics of the ruined temple can be seen today also in the agricultural fields of Rayavaripalli and field is called as 'Lingaakaaram kaada kayya', till today, which means a piece of agricultural field near Siva Lingam.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3876.8995641098563!2d79.03960227508865!3d13.663870686718994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb2bf8cb20b112f%3A0x38dd65aa00fad13e!2sSiddheswara%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742228926914!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://hindutemples-india.blogspot.com/2019/07/siddheswara-swamy-temple-talakona-andhra-pradesh.html",
          "image":"/132.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 133, 
          "name": "Somarama",
          "text": "Somarama is one of the five Pancharama Kshetras that are sacred to the Hindu god Shiva. The temple is located in Bhimavaram of West Godavari district in the Indian state of Andhra Pradesh. It is one of the centrally protected monuments of national importance.",
          "history":"This temple is an old, however has newer paintings on the walls and sculptures.At the front of the temple is a lotus covered pond called Chandrakundam. There is a large gopuram at the temple entrance. In the left side of temple, there is a big hall in which temples of the deities Rama and Hanuman are present.On the right side of temple, there is an open hall above the temple office. When a crowd is present, pujaris/pandits conduct puja here for individuals. The temple has many sculptures. In the hall of temple, there is a big statue of Nandi. After crossing hall, there is a room in front of sanctum. In that room there is a temple of the goddess Annapurna.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3824.699767140208!2d81.53281967514602!3d16.541248084208735!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a37d2af6b261c4b%3A0x534d565e3d839021!2sSomaramam%20Sri%20Someswara%20swamy%20Temple!5e0!3m2!1sen!2sin!4v1742268835549!5m2!1sen!2sin",
          "district":"West Godavari",
          "website":"https://www.poojn.in/post/16016/somarama-temple-visit-your-complete-guide?srsltid=AfmBOopnHmBhEhcftuzIqcrCVaHx1zdvHz4bm4957pIYZ-wY10JY4ILU",
          "image":"/133.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 134, 
          "name": "Sri Sunama Jakini Matha",
          "text": "Sri Sunama Jakini Maata was born in Suryavamshi Kshatriya Are-Katika community of Pinnepalli village in Anantapur district, Andhra Pradesh, India. A temple was built for this goddess in Gooty town of Anantapur district, Andhra Pradesh is also one of the first temple for Suryavamshi Kshatriya Are-katika community.",
          "history":"Sri Sunama Jakini maata was born in Malkari gotram from the Are-Katika community at Pinnepalli village of Yadiki mandal, Tadipatri taluk, Anantapur district (officially: Anantapuramu), Andhra Pradesh state of India. She married to Hanumanthakari Thanji Rao at a very young age. She was very devotional and use to observe fasting very often. One day during fasting she fell unconscious. Her husband thought that she was dead and ordered to bury her. Locals requested her husband to pass on the message to her mother, father and brothers who live in Pinnepalli village. Her husband did not allow this. As the locals were getting ready to bury her, they found that Sunama maata was still alive and informed the same to her husband. Under the influence of alcohol her husband ordered them to bury her anyways. In that sense Sunama Jakini maata took Jeeva Samadhi (Buddhism: Nirvana). It is estimated that this incident took place around 1803 AD.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3851.457835227338!2d77.62361167511665!3d15.133180685418775!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb69441e97d417f%3A0x99e39e1d270c306a!2sSri%20Sunama%20Jakani%20Temple%2CGooty!5e0!3m2!1sen!2sin!4v1742269411417!5m2!1sen!2sin",
          "district":"Anantapur",
          "website":"https://www.pilgrimaide.com/blog/Sri-Sunama-Jakini-Matha?srsltid=AfmBOootEOGI2jVUDnekI304Gu9gFWhp_5oo8NI632HO3s33yOMKS0UQ",
          "image":"/134.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 135, 
          "name":"Srikalahasteeswara temple",
          "text": "The Srikalahasti Temple is located in the town of Srikalahasti, in Tirupati district in the state of Andhra Pradesh, India. According to regional tradition, it is said to be the site where Kannappa was ready to offer both his eyes to cover blood flowing from the Shivalinga before Shiva stopped him and granted him moksha. The inner temple was constructed around the 5th century CE and the outer temple was constructed in the 11th century by the Agnikula khstriyas Rajendra Chola I and other Chola emperors such as Rajaditya Chola, Rajaraja Chola I, Rajadhiraja Chola I, Kulottunga Chola I, Kulottunga Chola III, and Vhanni Reddi kingdom,Vijayanagar Empire. The 120 feet (37 m) high main gopuram and the hundred pillared hall with intricate carvings was commissioned during the regime of the Vijayanagara Krishnadevaraya during 1516 CE. Shiva in his aspect as Vayu is worshipped as Kalahasteeswara. The temple is also regarded as Rahu-Ketu kshetra and Dakshina Kailasam.",
          "history":"Around the 11th century CE, the Chola emperor Rajendra Chola I king renovated the temple and constructed the main structure. Kulottunga Chola I, contrived and built the beautiful gopurams, located at the entrance facing south, during the 11th century CE. Inscriptions of Rajaditya Chola, Rajaraja Chola I, Rajadhiraja Chola I, Kulottunga Chola I, Kulottunga Chola III are found across the temple. The temple received contributions from various ruling dynasties like Chola Dynasty, Reddi kingdom and Vijayanagar Empire. The 120 feet (37 m) high main gopuram and the hundred pillared hall with intricate carvings was commissioned during the regime of the Vijayanagara Krishnadevaraya during 1516 CE.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3875.459355794185!2d79.69657837509025!3d13.75114968664059!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d3e54318a70e9%3A0x706957a2638f13c1!2sSrikalahasti%20Temple!5e0!3m2!1sen!2sin!4v1742269661289!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://srikalahasthitemple.com/",
          "image":"/135.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 136, 
          "name": "Srungara Vallabha Swamy Temple",
          "text": "Sri Srungara Vallabha Swami Temple is a historic Hindu temple located in Chadalada Tirupati village (commonly referred to as Tholi Tirupati) in Kakinada district, Andhra Pradesh, India. The temple is dedicated to Sri Srungara Vallabha Swami, a manifestation of Lord Venkateswara (Lord Vishnu), and is notable for its historical and architectural significance.",
          "history":"The Sri Srungara Vallabharaya Swami Temple was constructed prior to 12th century. Historical records, particularly inscriptions found in the temple, document various land donations made to the temple by local rulers. These inscriptions reflect the socio-political and religious practices of the time. The region, once part of the Prolunadu area, was governed by various dynasties including the Guptas, Satavahanas, Eastern ChalukyasPalli Pallavas,Kakatiyas, and Reddi rulers.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3812.398941370803!2d82.14743347515953!3d17.150794083696585!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a37655555555555%3A0xe8f575178f7c78b6!2sSri%20Srungara%20Vallabha%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742269958301!5m2!1sen!2sin",
          "district":"Kakinada",
          "website":"https://hindupost.in/dharma-religion/srungara-vallabha-swamy-temple-toli-tirupati-andhra-pradesh/",
          "image":"/136.jpeg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 137, 
          "name": "Sri Surya Narayana Swamy Devalayam",
          "text": "Arasavalli Sri Surya Narayana Swamy Devalayam is a temple for Lord Surya, the solar deity, at Arasavalli in the Indian state of Andhra Pradesh. It is located in Arasavalli Village 1 km east of Srikakulam. It is believed that the temple was built in 7th century CE by King Devendra Varma, a great ruler of Eastern Ganga Dynasty of Kalinga. The present structure is largely a result of 18th-century renovations. The temple was built in Rekha deula style of Kalinga Architecture like Puri Jagannath temple of Odisha. This temple is considered one of the oldest sun temples in India.[citation needed] The temple is one of the two major temples who worship Lord Surya in India. The other two are the Konark Sun Temple, Odisha and Martand Sun Temple, Jammu and Kashmir (union territory).",
          "history":"According to Padmapuranam, Sage Kasyapa installed the Idol of Surya at Arasavalli for the welfare of mankind. The Surya is of Kasyapasa Gotra. He is also termed a planetary King. The walls are inscribed saying the creator of the temple was the ruler Devendra Varma, stating it was built in the time period known to them as the 7th century. The walls also state the temple was fixed and changed to help with some of the sun temple's major flaws during the 18th and 19th century. Many of these changes were donated by the Dusi family.[citation needed] The temple fell into disrepair over the centuries and was reconstructed in 1778 CE by Elamanchili Pullaji Panthulu. Over the years the Sun temple was a landmark for many of the festivals celebrated in the town. Including festival Rathasaptami.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3788.297118859496!2d83.91097377518605!3d18.288015682760978!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3c15748c4a26a9%3A0x74f7ce6bc1bfae43!2sSri%20Sri%20Sri%20Suryanarayana%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742280612184!5m2!1sen!2sin",
          "district":"Srikakulam",
          "website":"https://www.arasavallisungod.org/abouttemple.html",
          "image":"/137.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 138, 
          "name": "Suryanarayana Swamy Temple, Gollala Mamidada",
          "text": "Sri Suryanarayana Swami Temple is a Sun temple situated in Gollala Mamidada village in Kakinada district of Andhra Pradesh, India. The temple was founded in 1920 by Sri Kovvuri Basivi Reddy, the zamindar of Gollala Mamidada, near the Antharvahini river amongst 16 acres of grass fields and coconut palms. The temple is 20 km (12 mi) from Kakinada and 58 km (36 mi) away from Rajahmundry. Some of the rites and festivals performed include Archanas, Abhishekams, Ratha Saptami, and Ekadasi.",
          "history":"Sri Suryanarayana Swamy Temple at Gollalamamidada village was incepted by late Sri Kovvuri Basivi Reddy Garu in the year 1920, a great Charitable and auspicious and dedicated mind Jamindar of Gollalamamidada. He has not only rendered dedicated service for the temple, but also dedicated his life for the benefit and welfare of the public at large. This temple own 16 Acres of wet land donated by successors of late founder for the maintenance and up – keep of the temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3816.787747735568!2d82.07105217515473!3d16.935758983876447!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a378f85545ca08d%3A0xa87606615c73b1e6!2sSri%20UshaPadmini%20Chaya%20Sougnaa%20Sametha%20Sri%20Suryanarayana%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742280989790!5m2!1sen!2sin" ,
          "district":"Kakinada",
          "website":"https://eastgodavari.ap.gov.in/temples/sri-suryanarayana-swamy-temple-g-mamidada/",
          "image":"/138.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 139, 
          "name": "Varaha Lakshmi Narasimha temple, Simhachalam",
          "text": "Sri Varaha Lakshmi Narasimha temple, Simhachalam, is a Hindu temple situated on the Simhachalam Hill Range,which is 300 metres above the sea level in the city of Visakhapatnam, Andhra Pradesh, India. It is dedicated to Lord Vishnu, who is worshipped there as Varaha Narasimha. As per the temple's legend, Vishnu manifested in this form (lion's head and human body) after saving his devotee Prahlada from a murder attempt by the latter's father Hiranyakashipu. Except on Akshaya Trutiya, the idol of Varaha Narasimha is covered with sandalwood paste throughout the year, which makes it resemble a linga. The temple was built in Kalingan architecture styles and stands unique in the historical region of Kalinga.The Present temple was built by Eastern GangaPallava king Narasingha Deva I in the 13th century and consecrated by his son Bhanudeva I in 1268 CE. The temple was built by Akthayi Senapati, on the command of Narasingha Deva I.",
          "history":"Simhachalam temple has a past of nearly a thousand years. Epigraphists discovered nearly 500 inscriptions in the temple complex. Almost all of them were dana sasanas (donation records) which referred to the contributions made by the kings, their officers, and the citizens. Majority of the inscriptions are bilingual, written in Sanskrit and Telugu languages. While some are exclusively in Sanskrit, there are 46 Odia and three Tamil language inscriptions. As per the common acceptance of historians, Simhachalam temple has been recognised in the 11th century CE due to an inscription by the Chola king Kulottunga I. The earliest inscription discovered in the temple, it belonged to the 11th century and was dated to 1087 CE. It recorded the gift of a garden by a private individual. The temple functioned well during this period and received liberal patronage from the Later Cholas.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m16!1m12!1m3!1d7598.851695782837!2d83.24344859200136!3d17.77167233272979!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!2m1!1sVaraha%20Lakshmi%20Narasimha%20temple%2C%20Simhachalam!5e0!3m2!1sen!2sin!4v1742281268519!5m2!1sen!2sin",
          "district":"Visakhapatnam",
          "website":"https://www.incredibleindia.gov.in/en/andhra-pradesh/visakhapatnam/varaha-lakshmi-narasimha-temple",
          "image":"/139.jpeg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 140, 
          "name": "Varahaswamy Temple",
          "text": "The Sri Varahaswamy Temple, also called Bhu Varahaswamy Temple, is a Hindu temple dedicated to the god Varaha, situated at hill town of Tirumala in Tirupati, located in Tirupati district of Andhra Pradesh state, India. The temple is situated on the northern premises of Venkateshvara Temple, Tirumala, on the north-west corner of Swami Pushkarini. This temple is believed to be older than the Venkateshvara shrine.",
          "history":"The temple was renovated by Pedda Tirumalacharya in the year 1535 CE.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3935458.274981064!2d75.34041293653048!3d15.579838304404483!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb2b56400000001%3A0x98fb44a3f9cbe8f8!2sShri%20Varaha%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742281568999!5m2!1sen!2sin" ,
          "district":"Tirupati",
          "website":"https://www.bhoovarahatemple.com/home.html",
          "image":"/140.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 141, 
          "name": "Vedadri Narasimha Temple",
          "text": "Vedadri Narasimha Temple is a Hindu temple located in the town of Vedadri, Andhra Pradesh, India. It is dedicated to the worship of Narasimha. This temple is a major pilgrimage site in Andhra, attracting thousands of devotees every year, and it is one of the Pancha Narasimha Kshetras. The temple is located on the bank of the Krishna River.",
          "history":"According to the temple's historical tradition (sthalapurana), Vedadri represents the Vedas in the form of a hill. This mythological tradition relays that a demon named Somakasura stole the Vedas from Brahma and hid them in the ocean. The panicked gods are said to have prayed to Vishnu, who appeared in the form of Narasimha to rescue the Vedas by turning them into Vedadri on the river Krishna.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3819.221112732854!2d80.12216837515203!3d16.815383383977505!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a35a6e400000001%3A0xc485d307483093b7!2sVedadri%20Temple!5e0!3m2!1sen!2sin!4v1742281853044!5m2!1sen!2sin" ,
          "district":"NTR",
          "website":"https://www.tirthayatra.org/yogananda-narasimha-temple-vedadri/",
          "image":"/141.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 142, 
          "name": "Vedanarayana Temple, Nagalapuram",
          "text": "Vedanarayana Temple or Matsya Narayana Temple is a Hindu temple in Nagalapuram, Andhra Pradesh, India. It is a Vaishnava temple is dedicated to Lord Vishnu in the form of Matsya, the fish avatar, who is referred to as Matsya Narayana or Veda Narayana. This is one of the few temples in India where Lord Vishnu is depicted in Matsya avatar, the first incarnation of the Dashavatara, Lord Vishnu's 10 main incarnations.",
          "history":"This temple was started by Vijayanagara King Sri Krishna Devaraya on behest of this mother Nagamamaba. So it’s also called as Nagamamba Puram. This temple was stone temple by Chola and Pallava kings. Here, Lord is in the form of Half-Fish and Half-Human. Here lord Vishnu is in Matsya avatar, the lord who saved Vedas from Demon Somakasura. Here Lord Surya gives visual feast to the devotees by giving his sun rays on Surya Pooja.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3881.4003413571877!2d79.79227657508376!3d13.38751923696749!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a4d6108ba18d4f1%3A0x60626521eba956!2sShri%20Veda%20Narayana%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742282048636!5m2!1sen!2sin",
          "district":"Tirupati",
          "website":"https://tirupatitemple.info/nagalapuram-temple-timings-darshan-seva/",
          "image":"/142.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 143, 
          "name": "Veerabhadra Temple, Lepakshi",
          "text": "Veerabhadra temple is a Hindu temple located in the Lepakshi, in the state of Andhra Pradesh, India. The temple is dedicated to the Virabhadra, a fierce form of the god Shiva.Built in the 16th century, the architectural features of the temple are in the Vijayanagara style with profusion of carvings and paintings at almost every exposed surface of the temple. It is one of the centrally protected monuments of national importance and is considered one of the most spectacular Vijayanagara temples. The fresco paintings are particularly detailed in very bright dresses and colours with scenes of Rama and Krishna from the epic stories of the Ramayana, the Mahabharata and the Puranas and they are well preserved.",
          "history":"The temple was built in 1530 AD by Virupanna Nayaka and Viranna, both brothers who were Governors under the Vijayanagar Empire during the reign of King Achyuta Deva Raya, at Penukonda who were native to Karnataka. They belonged to the warrior merchant class of Veerashaiva Vani. The temple consists of only Kannada inscriptions. The cost of building the temple was defrayed by the government. According to Skanda Purana, the temple is one of the divyakshetras, an important pilgrimage site of Lord Shiva",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3874.618906184454!2d77.60679827509115!3d13.801832186595279!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb199cb317e8001%3A0x6f81405bc37d935b!2sShri%20Veerabhadra%20Swamy%20Temple!5e0!3m2!1sen!2sin!4v1742282486846!5m2!1sen!2sin" , 
          "district":"Anantapur",
          "website":"https://lepakshitemple.in/veerabhadra-swamy/",
          "image":"/143.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        },
        { 
          "t_id": 144, 
          "name": "Venkateswara Temple, Dwaraka Tirumala",
          "text": "Sri Venkateswara Temple is a Hindu temple located in Dwaraka Tirumala of Eluru district in the Indian state of Andhra Pradesh. It is dedicated to Lord Venkateswara, an incarnation of Lord Vishnu. Known as 'Chinna Tirupati', it is considered a spiritual alternative to the famous Tirupati temple. The temple is unique for housing two idols of Lord Venkateswara: a self-manifested idol and a second idol installed for complete worship.",
          "history":"The construction of key structures, including the vimana, mantapa, gopura, and prakara is attributed to Dharma Appa Rao, a ruler. Additionally, the golden ornaments and silver vahanas at the temple were donated by Rani Chinnamma Rao, the queen of Mylavaram in Krishna District, who reigned from 1877 to 1902. These contributions significantly enhanced the temple's grandeur.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7632.751723026187!2d81.25187389192665!3d16.95605238543749!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a365b7ec0000001%3A0x8e25f5e869c3601b!2sSri%20Venkateswara%20Swamy%20Vari%20Devasthanam%20Dwaraka%20Tirumala!5e0!3m2!1sen!2sin!4v1742283083628!5m2!1sen!2sin" ,
          "district":"Eluru",
          "website":"https://utsav.gov.in/view-darshan/dwaraka-tirumala-temple-1",
          "image":"/144.jpeg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 145, 
          "name": "Venkateswara Temple, Tirumala",
          "text": "Tirumala or Tirumalai is a Hindu religious temple town in Tirupati district of the Indian state of Andhra Pradesh. It is one of the neighbourhoods of the Tirupati city. The town is a part of Tirupati Urban Development Authority and located in Tirupati (urban) mandal of Tirupati revenue division. The town is strictly vegetarian. It is a hill town where Tirumala Venkateswara Temple is located, a popular shrine of Vishnu. Vishnu is believed to reside here with his full power, as in Vaikuntha, and thus the place is also called 'Bhuloka Vaikuntha'",
          "history":"The first recorded endowment was made by Pallava queen Samavai in the year 966 CE. She donated many jewels and two parcels of land (one 10 acres and the other 13 acres) and ordered to use the revenues generated from that land to be used for the celebration of major festivals in the temple. The Pallava dynasty (9th century), the Chola dynasty (10th century), Reddi kingdom (12th and 13th centuries) and Vijayanagara pradhans (14th and 15th centuries) were committed devotees of Lord Venkateswara. The temple gained most of its current wealth and size under the Vijayanagara Empire, with the donation of diamonds and gold. In 1517, Vijayanagara Emperor Krishnadevaraya, on one of his many visits to the temple, donated gold and jewels, enabling the Ananda Nilayam (inner shrine) roofing to be gilded. After the decline of Vijayanagara Empire, leaders from states such as the Kingdom of Mysore and the Gadwal Samsthanam worshiped as pilgrims and gave ornaments and valuables to the temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d124050.16276915444!2d79.19910134335939!3d13.684037499999999!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb2b562a5cc709b%3A0x407a00bd52587d32!2sSri%20Venkateswara%20Swamy%20Temple%20(Tirumala%20Tirupathi%20Devasthanam)!5e0!3m2!1sen!2sin!4v1742283349714!5m2!1sen!2sin" ,
          "district":"Tirupati",
          "website":"https://www.tirumala.org/",
          "image":"/145.jpeg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 146, 
          "name": "Vinayaka Temple, Kanipakam",
          "text": "Sri Varasidhi Vinayaka Swamy Temple is a Hindu temple of Ganesha. It is located at Kanipakam in Chittoor district of Andhra Pradesh, India.[1] The temple is about 11 km from Chittoor and 68 km from Tirupati.",
          "history":"The temple was constructed in the early 11th century CE by the Chola Emperor Kulottunga I and was expanded further in 1336 by the Emperors of Vijayanagara.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3883.1769514826465!2d79.02945948885497!3d13.276880100000003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bad5fc389bcd3b9%3A0x280c79e75c172f55!2sSri%20Swayambhu%20Varasidhi%20Vinayaka%20Swamy%20Devastanam%2C%20Kanipakam!5e0!3m2!1sen!2sin!4v1742284392018!5m2!1sen!2sin" ,
          "district":"Chittoor",
          "website":"https://srikanipakadevasthanam.org/en-in/home",
          "image":"/146.jpg",
          "state":"Andhra Pradesh",
          "country":"India" 
        },
        { 
          "t_id": 147, 
          "name": "Sri Yaganti Uma Maheswara Temple, Yaganti",
          "text": "Yaganti Temple or Sri Yaganti Uma Maheswara Temple is a temple of Shiva in Nandyal district in the India state of Andhra Pradesh. It was built according to Vaishnavaite traditions.",
          "history":"This temple was constructed by King Harihara Bukka Raya of the Sangama Dynasty of the Vijayanagara Empire in the 15th century.[citation needed] It was built according to Vaishnavaite traditions.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3847.472713684527!2d78.13587347512096!3d15.350864385229348!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bb4319417241541%3A0x70f1feee60c64aed!2sSri%20Yaganti%20Uma%20Maheswara%20Temple!5e0!3m2!1sen!2sin!4v1742284737877!5m2!1sen!2sin" ,
          "district":"Nandyal",
          "website":"https://www.trawell.in/andhra/yaganti/uma-maheshwara-temple",
          "image":"/147.jpg",
          "state":"Andhra Pradesh",
          "country":"India"
        }
      ]
    },

    { 
      "id": 2, 
      "name": "Arunachal Pradesh",
      "temples": [
        {
          "t_id": 201,
          "name": "Parshuram Kund",
          "text": "Parshuram Kund is a Hindu pilgrimage site in the Lohit district of Arunachal Pradesh, India. It is situated on the Brahmaputra plateau in the lower reaches of the Lohit River and about 48 km from Tezu in Lohit district of Arunachal Pradesh, India. Dedicated to the sage Parashurama, the popular site attracts pilgrims from Nepal, from across India,including the nearby states of Manipur and Assam. Over 70,000 devotees and sadhus take a holy dip in its water each year on the occasion of Makar Sankranti, in the month of January.",
          "history":"The site of the Parashuram Kund as established by the Sadhu was in existence until the 1950 Assam earthquake that shook the whole of the North-East and the kund was completely covered. A very strong current is now flowing over the original site of the kund but massive boulders have in a mysterious way embedded themselves in a circular formation in the river bed thus forming another kund in place of the old. The temple which is believed to be the home of Malini (Parvati) is situated on the rocky hills of the Ghagra and Ghai rivers in the Likabali sub-division.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14602585.693082487!2d80.08980944749875!3d26.67778312024626!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x373e792bfaaaaaab%3A0xcb07b9200be4ea86!2sShree%20Parshurama%20Kunda%20Temple!5e0!3m2!1sen!2sin!4v1742206959799!5m2!1sen!2sin",
          "district":"Lohit",
          "website":"https://lohit.nic.in/tourist-place/parshuram-kund/",
          "image":"/201.jpg",
          "state":"Arunachal Pradesh",
          "country":"India"
        },
        {
          "t_id": 202,
          "name": "Rangnuwk hum",
          "text": "Rang Nuwk Hum is a worship place for the Tangsa people of Northeast India and Myanmar. 'Rang' means the God, 'Nuwk' means pray and 'Hum' means a small house that contain a picture of the God Rangfrah. Rangfrah is believed to be an incarnation of the Hindu god Shiva. Devotees go to a Rang Nuwk Hum everyday to give offerings and to pray which is followed by singing local bhajans.",
          "history":"The Tangshang in Myanmar as well as the Tangsa in India regard themselves as a Naga tribe. They are well-built and of medium-stature. Today Tangsa people live in the Patkai mountains, on the border of India and Burma, and some live in the plains areas on the Indian side of the border. Many Tangsa tell of migrations from what is now Mongolia, through the South-West China Province of Yunan into Burma. Tangsa traditions suggest that they settled in the existing region from the beginning of the 13th century.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3617361.123756436!2d91.30438157058146!3d27.699397152616264!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x373ed5ebd94fffff%3A0x2f87a0ed03059b22!2sRang%20Frah%20RangShum%20Him%20-%20New%20Changlang!5e0!3m2!1sen!2sin!4v1742207699341!5m2!1sen!2sin",
          "district":"Changlang",
          "website":"https://get2knowindia.com/rangnuwk-hum/",
          "image":"/202.jpeg",
          "state":"Arunachal Pradesh",
          "country":"India"
        }
      ]
    },

    { 
      "id": 3, 
      "name": "Assam",
      "temples":[
        {
          "t_id":301,
          "name": "Bhairabi Temple",
          "text": "The Bhairabi Temple is located on the outskirts of Tezpur of Sonitpur District in Assam, India.",
          "history":"The Goddess Bhairavi is worshipped here as she is one of the Mahavidyas of Maa Durga Devi. It is a very important Shakta pitha of Assam. The backdrop of the temple is a view looking towards the Kolia Bhomora Setu across the Brahmaputra River. The temple site is also locally known Bhairabi Devalaya. Legend has it that Usha (daughter of mighty Asura King Banasura) regularly came here for the worshipping of the Goddess.[1][2] About a couple of kilometres away lie the Bamuni Hills where one can view the ruins of the palace that stood many centuries ago. The art work on stone carvings that were used within the structure are from the 9th century. Likewise, the 400-year-old Bhairabi temple has tilted slightly and a nearby building suffered damage to the west and south sides of the second and third stories and cracked the pillars and an unhinged roof due to an earthquake. Following the damage, religious ceremonies or daily prayers have come to a halt.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3768.1903749995618!2d84.76654087520816!3d19.186885582040738!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a3d434a3be20fa3%3A0x7157725d3d025a35!2sSidhha%20Bhairavi%20Temple%20%2C%20Mantridi!5e0!3m2!1sen!2sin!4v1742310098044!5m2!1sen!2sin" ,
          "district":"Sonitpur",
          "website":"https://ganjam.odisha.gov.in/tourism/tourist-places/bhairabi-temple",
          "image":"/301.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":302,
          "name": "Dah Parvatiya",
          "text": "Da Parbatia is a small village very close to west Tezpur, in the Indian State of Assam. In the village there are significant architectural remnants of an ancient temple of the 6th century overlying the ruins of another Shiva temple built of bricks during the Ahom period. Archaeological excavations done here in 1924 have unearthed a sixth-century antiquity in the form of a stone door frame with extensive carvings. The ruins of the temple built during the Ahom period are built over the ancient temple's foundations and are in the form of a stone paved layout plan of the sanctum sanctorum and a mandapa. This complex is under the jurisdiction of the Archaeological Survey of India and its importance and notability is recorded under the Ancient Monuments and Archaeological Sites and Remains Act 1958.",
          "history":"The antiquities found at the Dah Parvatiya are inferred to have been from a temple complex built during the 5th or 6th century, prior to the Bhaskaravarman period. On the basis of the mouldings and its architectural style it is inferred that the terracotta plaques are definitely not later than the 6th century; the altered form of motifs noted in Assam confirms this assessment. This type of architectural feature, particularly in the stylistics of figurines of the ruins, is seen in North India, in the temples of the Bhumra and Nachha Kuthara which belonged to the Gupta period. Further confirmation of the dating is provided by the carvings of the river Goddesses Ganga and Yamuna, which are also akin to the Greek architecture with striking similarity to the Hellenistic art. The decorative elements of the ruins also have close similarity with those seen in the temples of Orissa.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d28530.316828686806!2d92.75061043400433!3d26.639208465888558!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3744c27a6f474b8b%3A0xc8416a661e792690!2sDa-Parbatia%20Gaon%2C%20Assam!5e0!3m2!1sen!2sin!4v1742310326892!5m2!1sen!2sin" ,
          "district":"Sonitpur",
          "website":"https://sonitpur.assam.gov.in/tourist-place-detail/272",
          "image":"/302.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":303,
          "name": "Deopani Durga Mandir",
          "text": "Deopani Durga Mandir is a Hindu Shakti temple of Goddess Durga situated in Asean highway 1, Borsewaguri, Bokajan, Karbi Anglong, Assam, India - 782470.",
          "history":"The idol of the temple was excavated along with some other archaeological materials and the temple was established in the site where the idol was discovered.A significant amount of archaeological findings from the Deopani area are documented. The temple is managed by a trust.[6] Annual Durga Puja is celebrated in the temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3579.373742736918!2d93.82482557541569!3d26.217043077068677!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x37467a2907a02937%3A0x44c3966d7331a92c!2sDeopani%20Durga%20Temple!5e0!3m2!1sen!2sin!4v1742310562554!5m2!1sen!2sin" ,
          "district":"Karbi Anglong",
          "website":"https://www.deopanidurgamandir.com/",
          "image":"/303.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":304,
          "name": "Dhekiakhowa Bornamghar",
          "text": "Dhekiakhowa Bornaamghar is a naamghar in Jorhat district, Assam, India, that was established by saint-reformer Madhavdeva. In 1528 (1450 Saka), Madhavdeva kindled an earthen lamp there, which according to the naamghar's managing committee has been burning continuously since then, being refueled with mustard oil by the priests. It is located at Dhekiakhowa village of Jorhat district, 15 km towards the east of Jorhat city 3.5 km away from National Highway 37. It is called a Bornaamghar because of its historical association and large campus.",
          "history":"There is an anecdote after the name of Dhekiakhowa Naamghar. Guru Madhavdeva after taking up the duty of reforming people and spreading the Ekasarana Naam Dharma came to stay in this small village. He took shelter for the night at the hut of an old woman, who served him rice with Dhekia Saak (Fiddlehead Fern), a very common wild vegetable. The old woman was very embarrassed to have served the Saint guru like this but he was immensely pleased by the dinner. So he started a naamghar there and given the responsibility of kindling the earthen lamp to the old woman. The naamghar was later known as Dhekiakhowa Naamghar.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3560.429479319567!2d94.32176727543647!3d26.82628897669871!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3746d952c7444151%3A0x66474a59840d41c0!2sDhekiakhowa%20Bor%20Namghar!5e0!3m2!1sen!2sin!4v1742311247142!5m2!1sen!2sin" ,
          "district":"Jorhat",
          "website":"https://jorhat.assam.gov.in/tourist-place-detail/251",
          "image":"/304.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":305,
          "name": "Dirgheshwari temple",
          "text": "Dirgheswari Mandir is a temple situated in the northern banks of the river Brahmaputra in North Guwahati, Assam, India. Many ancient images made on rocks existed along with the temple. Brick temple was Built by Ahom king Swargadeo Siva Singha, Dirgheswari temple is considered as a Shakti Peetha for Shakti Worship. The main attraction of Dirgheswari temple is the annual Durga Puja celebrations, in which devotees from far of places use to attend.",
          "history":"It is not known if any temple of Goddess Durga existed in Dirgheswari during ancient and early medieval period. The present temple at Dirgheswari was constructed by Ahom king Swargadeo Siva Singha reign 1714 CE-1744 CE, under the supervision of Tarun Duwarah Barphukan, the Ahom viceroy of Guwahati and Lower Assam. The temple was constructed using bricks, at the top of the hill, which is filled with solid rocks. The Garbha-griha or the inner chamber of the temple, where the idol of Goddess Durga was present is located underground, in a small cave.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3578.557988215159!2d91.74653757541654!3d26.24354797705236!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a50beda3a3b3b%3A0x280e00fba815a38e!2sDIRGHESWARI%20TEMPLE!5e0!3m2!1sen!2sin!4v1742311496152!5m2!1sen!2sin" ,
          "district":"Kamrup",
          "website":"https://kamrup.assam.gov.in/tourist-place-detail/279",
          "image":"/305.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":306,
          "name": "Doul Govinda Temple",
          "text": "Doul Govinda Temple is one of the important temples of Kamrup, Assam, India. It is situated on the northern banks, on the foothills of Chandra Bharati hill at Rajaduar, North Guwahati. The temple is mainly devoted to Lord Krishna. Besides, there is an Namghar along with the temple within the same premises. The temple is open and accessible all the year round, but one can enjoy the thrill of a river cruise as well as walking on white sands of the beaches of Brahmaputra, from the month of November to April.",
          "history":"Several stories exists regarding this deity and how 'He' was brought here by late Ganga Ram Barooah from a place called Sandhyasar near Nalbari. The first structure of Doul Govinda Temple was erected more than one hundred and fifty years ago but it was again renovated in 1966.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3579.694486687312!2d91.73897927541533!3d26.206614877075108!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a5a11c41b759b%3A0xe0a5e50f37c5a249!2sDoul%20Govinda%20Mandir!5e0!3m2!1sen!2sin!4v1742313437029!5m2!1sen!2sin" ,
          "district":"Kamrup",
          "website":"https://kamrup.assam.gov.in/tourist-place-detail/276",
          "image":"/306.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":307,
          "name": "Silghat",
          "text": "Silghat is a town located on the southern banks of the Brahmaputra, in Nagaon district in the Indian state of Assam. It is 48 km northeast of Nagaon. With a river and hills, the scenery of Silghat attracts local and visitors throughout the year. Silghat is home to Kamakhya Temple, Trishuldhari (religious cum picnic spot), Samantagiri, Simala Garh, Manuh Kata Tumoni, heritage British era bungalows, Gandhi Asthidham, and Sudhakantha Sammanoi Khetra. Every year in March or April (Chot/Bohag), Ashokastami mela is held at Slighat's holy river bank. The Assam Cooperative Jute Mill Ltd. operates in Silgha",
          "history":"Silghat Trishuldhari, a temple dedicated to Lord Shiva is situated on the southern bank of the River Brahmaputra. The major attraction of the temple is the fact that it is 2000 years old. It is believed that whoever comes to seek blessings here has his or her wish granted and also lives a prosperous life. ",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d28536.344948861202!2d92.92104373395092!3d26.61506461682212!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3744f10045bb07b1%3A0x6affcaaca5cc39b2!2sSilghat%2C%20kamakhya%20temple.!5e0!3m2!1sen!2sin!4v1742313915394!5m2!1sen!2sin" ,
          "district":"Nagaon",
          "website":"https://nagaon.assam.gov.in/tourist-place-detail/225",
          "image":"/307.jpeg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":308,
          "name": "Hayagriva Madhava Temple",
          "text": "Hayagriva Madhava Temple is situated on the Manikut hill. The hill is situated in Hajo of Kamrup District in Assam, India. Which is around 30 km to west of Guwahati. The Kalika Purana composed in the 11th century CE in Kamarupa talks about the origin of this form of Vishnu and his final establishment in the hill of Monikut, where the present temple is located. The present temple structure was constructed by the King Raghudeva Narayan in 1583. According to some historians the King of Pala dynasty constructed it in 10th century. It is a stone temple and it enshrines an image of Hayagriva Madhava. Some Buddhists believe that the Hayagriva Madhava temple, best known in the group of Hindu temples, is where the Buddha attained Nirvana. At this imposing temple, the presiding deity is Vishnu, worshipped in the sanctum sanctorum as an idol carved of black stone. Four other stone idols are also in worship as subsidiary deities.",
          "history":"Sayani, the first wife of Kalia Bhomora Borphukan donated a family of paiks and also a plot of land for their maintenance to the Hayagriva Madhava temple during the reign of Ahom king Kamaleswar Singha. The lamps in the sanctum sanctorum are never put off (akhanda deep) ever. Oil flows into the big earthen lamps through a simple tube connected to the oil tin.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3578.5817315606687!2d91.52400937541657!3d26.242776877052883!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a481924736bf3%3A0x5207bcdfa8067f57!2sShree%20Shree%20Hayagriva%20Madhab%20Temple!5e0!3m2!1sen!2sin!4v1742315035229!5m2!1sen!2sin" ,
          "district":"Kamrup",
          "website":"https://kamrup.assam.gov.in/tourist-place-detail/271",
          "image":"/308.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":309,
          "name": "Kamakhya Temple",
          "text": "The Kamakhya Temple at Nilachal hills in Guwahati, Assam is one of the oldest and most revered centres of Tantric practices, dedicated to the goddess Kamakhya. The temple is the center of the Kulachara Tantra Marga and the site of the Ambubachi Mela, an annual festival that celebrates the menstruation of the goddess. Structurally, the temple is dated to the 8th-9th century with many subsequent rebuildings and the final hybrid architecture defines a local style called Nilachal. It is also one among the oldest 4 of the 51 pithas in the Shakta tradition. An obscure place of worship for much of history it became an important pilgrimage destination, especially for those from Bengal, in the 19th century during colonial rule.",
          "history":"Historians have suggested that the Kamakhya temple was likely an ancient sacrificial site for Khasi and Garo peoples and that the name originates in the Khasi goddess, Ka Meikha; and these claims are supported by the folklores of these very peoples. The traditional accounts from Kalika Purana (10th century) and the Yogini Tantra too record that the goddess Kamakhya is of Kirata origin, and that the worship of Kamakhya predates the establishment of Kamarupa.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14323.871594372771!2d91.69420414941298!3d26.16517491877559!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a5b04b0f06ef1%3A0xaaad40304c7d3d1d!2sMaa%20Kamakhya%20Temple!5e0!3m2!1sen!2sin!4v1742315420202!5m2!1sen!2sin",
          "district":"Kamrup Metropolitan",
          "website":"https://www.maakamakhya.org/",
          "image":"/309.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":310,
          "name": "Ketakeshwar Dewal",
          "text": "Ketakeshwar Dewal (shrine) is a holy site in the Ketakibari area of Tezpur in Assam, India. It is reputed to have one of the largest Shivalingas in the world. The actual site has two parts - one part where the actual linga is located and another part a few metres away where the original base of the linga is located. Legend has it that during a severe earthquake in the past the linga was uprooted from its base and deposited where it currently stands.",
          "history":"Ketakeshwar Dewal stands as a testament to the Katyuri rulers legacy and their devotion to Lord Shiva. The temple has also been mentioned in various ancient texts and scriptures, further solidifying its historical importance. The temple is revered by devotees for its spiritual energy and divine presence. It is believed that worshipping at the temple can bring blessings, prosperity, and fulfillment of desires. The annual Maha Shivaratri festival, dedicated to Lord Shiva, is celebrated with great fervor at Ketakeshwar Dewal, drawing thousands of pilgrims and tourists to witness the grand festivities.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3565.990688447293!2d92.77781017543036!3d26.648780576805425!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3744e9df06b204cf%3A0x70da80dcc5833831!2sKetakeshwar%20Dewalay!5e0!3m2!1sen!2sin!4v1742315877541!5m2!1sen!2sin" ,
          "district":"Sonitpur",
          "website":"https://www.gopikakantadutta.in/2024/05/ketakeshwar-dewal-tezpur-assam.html",
          "image":"/310.jpeg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":311,
          "name": "Madhab Than",
          "text": "Madhab Than is a pilgrim center dedicated to lord Krishna, one of the main Hindu deities. It is situated in Kampur of Nagaon District in the state of Assam, India.",
          "history":"Burha Madhab Than’s history stretches back to ancient times, interwoven with captivating legends and historical accounts. The Ahom dynasty, known for its piety and architectural prowess, played a pivotal role in establishing and nurturing this sacred site. Their devotion to Lord Krishna manifested in the creation of this temple, believed to be a source of blessings and prosperity. The temple’s origins are intertwined with local folklore, passed down through generations, adding to its mystique and spiritual aura.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3583.976941490642!2d92.61776547541062!3d26.06700997716141!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3745399318e41fcb%3A0x37708202e7bc5fb8!2sSri%20Sri%20Madhab%20Than!5e0!3m2!1sen!2sin!4v1742316245487!5m2!1sen!2sin" ,
          "district":"Nagaon",
          "website":"https://www.poojn.in/post/16217/burha-madhab-than-sacred-history-and-significance-explored?srsltid=AfmBOopeTs7E2IKXpv2o5B_f-Q-p1-GF-E_oDnnFWfG7t8ikHEU2zv6j",
          "image":"/311.jpeg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":312,
          "name": "Mahabhairav Temple",
          "text": "Mahabhairav Temple is a Hindu temple dedicated to Lord Shiva. It is located at a hillock on the northern part of Tezpur town in Assam, India. It is said that king Bana built this Shiva temple and originally it was built of stone but the present one was renovated and built with concrete. During the Ahom rule, the kings especially of the Tungkhungia dynasty donated large area of Devotee land to the Temple and appointed pujaris, Paiks to look after the temple.",
          "history":"The history of this temple, which is visited by devotees from all over India,can be traced back to the age of the Puranas. Legend has it that Banasura, the demon king, who had his capital at Tezpur, first introduced the Linga worship. Inside the temple of Mahabhairab there is perhaps the largest stone-phallus or Shiva Linga in the entire world, which is said to have been set up by Banasura. The archaeologists however believe that the temple was built sometime during 8th to 10th century AD by the kings of the Salasthamba dynasty. Originally there was a stone temple which is evident from the huge pillars scattered all around the temple. But the original temple was destroyed by the ravages of time. It was however, rebuilt by successive kings and rulers, until it was heavily damaged by the catastrophic earthquake of 1897.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3566.4448437671094!2d92.7937520754299!3d26.634235976814278!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3744e9c98bfc72fb%3A0x876c34ea0666cf13!2sMahabhairab%20Temple!5e0!3m2!1sen!2sin!4v1742316475393!5m2!1sen!2sin" ,
          "district":"Sonitpur",
          "website":"https://biswanath.gov.in/portlet-sub-innerpage/mahabhairab-temple",
          "image":"/312.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":313,
          "name": "Mahamaya Dham",
          "text": "Mahamaya Dham or Mahamaya (supreme illusion) Temple of Bogribari, about 30 km east from Dhubri town and 10 km west from Bilasipara town, is regarded as a greatest Shakti Peethas for Hindu pilgrims in Lower Assam, India. It is located under Parbatjhora sub-division of district Kokrajhar. In terms of attractions, this temple is the second to Kamakhya Temple of Guwahati to the pilgrims and tourists. It is believed that the famous goddess Mahamaya was traditionally worshipped by the local people of Parvatjowar like Kacharies, Koches and Naths. It was also the presiding deity of the Zamindar of Parvatjowar. Latter the goddess received wide acceptance and these days, all Hindus of Lower Assam worship mother Mahamaya.",
          "history":"This temple has a 400-year-old tradition of animal sacrifice especially at the time of Durga Puja. Usually hundreds of animals or birds, like buffaloes,goats, pigeons and ducks are sacrificed. It is always rumoured that animals are sacrificed when new large scale construction especially bridge is undertaken. These days animal lovers are voicing against this ghastly tradition. Entrance to Temple complex, Mahamaya, Kokrajhar District.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3579.476500621846!2d90.11686977541557!3d26.2137025770707!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3758661d797efabb%3A0xcdf268dc2181feaa!2sMAA%20MAHAMAYA%20MILON%20POSHAD%20BHANDAR%20BAGRIBARI!5e0!3m2!1sen!2sin!4v1742316651903!5m2!1sen!2sin" ,
          "district":"Kokrajhar",
          "website":"https://kokrajhar.assam.gov.in/tourist-place-detail/218",
          "image":"/313.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":314,
          "name": "Malinithan",
          "text": "Malinithan is an archaeological site containing the ruins of an early medieval period temple on the northern bank of the Brahmaputra River in the Indian state of Arunachal Pradesh. It is assumed to be built by the Chutia kings in the 13th-14th century. Kechai-Khaiti, a tribal goddess found among the Bodo-kachari groups or the Buddhist goddess Tara is considered to be the chief deity worshipped in the ruined temple. The worship of the goddess Kechaikheiti even after coming under Hindu influence was performed according to her old tribal customs.",
          "history":"From all archaeological evidences at the site, archaeologists have opined that the temple belonged to the 13th century. Stonemason marks found in Malinithan[6] were also found in other sites of Sadiya like Tamreswari temple, Bura-buri, Padum pukhuri as well as other places like Nakshaparbat and Buroi.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3533.9280602643835!2d94.7123766754656!3d27.657697376210994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3740f29cec9cf425%3A0x663fb044111c8a1c!2sMalinithan%20Temple%20-%20Lower%20Siang%20district%2C%20Arunachal%20Pradesh%2C%20India!5e0!3m2!1sen!2sin!4v1742316917697!5m2!1sen!2sin",
          "district":"Lower Siang",
          "website":"https://arunachaltourism.com/malinithan-2/",
          "image":"/314.JPG",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":315,
          "name": "Navagraha temples",
          "text": "Navagraha pilgrimages are pilgrimages devoted to Navagraha—the nine (nava) major celestial bodies (Grahas) of Hindu astronomy. These temples are made of stone. These celestial bodies are named Surya (Sun), Chandra (Moon), Mangala (Mars), Budha (Mercury), Brihaspati (Jupiter), Shukra (Venus), Shani (Saturn), Rahu (North Lunar Node) and Ketu (South Lunar Node). Many temples in South India contain a shrine dedicated to the Navagrahas. However, the term Navagraha temples refers to a cluster of nine separate temples, each an abode of one of the Navagrahas.The Navagraha Temple is on the top of Chitrasal Hill (or Navagraha Hill), in Guwahati city, Assam, India. The existing brick temple on Chitrasal hill was built by Ahom king Swargadeo Rajeswar Singha during his reign from 1751 to 1769. Enshrined in this temple are nine Shivalingams, representing the nine Celestial bodies, each covered with a colored garment symbolic of each of the celestial bodies, with a Shivaligam in the centre symbolising the Sun. Connected to this Navagraha temple a nine-cornered (Na-kunia) tank was dug down in the valley South of it. This tank is presently known as Silpukuri.",
          "history":"The history of Navagraha temple Guwahati dates returned to the 18th century and is closely associated with the Ahom dynasty that dominated Assam from the 13th to the 19th century. The temple was ascended by the Ahom king, Swargadeo Rajeshwar Singh, sometime in the course of his reign in the early 18th century. Here visitors can see the Navagraha images in temples.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d57289.759161654096!2d91.68918851166337!3d26.17682968565364!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a598c0de31aa1%3A0xd1c729fa9a8fc6c9!2sNavagraha%20Temple!5e0!3m2!1sen!2sin!4v1742360156445!5m2!1sen!2sin" ,
          "district":"Kamrup Metropolitan",
          "website":"https://www.templepurohit.com/hindu-temple/navagraha-temple-guwahati/",
          "image":"/315.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":316,
          "name": "Negheriting Shiva Doul",
          "text": "The Negheriting Shiva Doul is a Shiva temple at Dergaon in Assam, India. Situated on a hillock at about one and half km north from the National Highway 37 in the Golaghat district of Assam.This is a national protected monument declared by Archaeological Survey of India. the temple was first constructed by the Dimasa Kacharis during 8th - 9th century CE. Later due to natural calamities it came into destruction. In 1765 it was re-constructed by Ahom king Swargadeo Rajeswar Singha. The famous architect assigned to the job was Ghanashyam Khonikar.",
          "history":"It is believed that the stones used to construct the temple were existed in the bank of river Dihing. Due to natural calamities the temple was destroyed and the remains were found in deep forest called Gajapanemara. However, as the Dihing river changed the course, the temple was again destroyed and merged into the river water. A devotee of lord Shiva found the ruined temple and the linga in the shallow water of river Dihing, now this place is known as Sheetal Negheri. Ahom king Rajeswar Singha (1751-1769) brought the linga from the river and reconstructed the present temple and established the Shivalinga in it.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3563.303088547105!2d94.00270777543335!3d26.734702476753807!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x374695f4789746b7%3A0x7b1579396b0f7e90!2sNegheriting%20Shiva%20Doul!5e0!3m2!1sen!2sin!4v1742360720274!5m2!1sen!2sin",
          "district":"Golaghat",
          "website":"http://www.assaminfo.com/tourist-places/28/negheriting-temple.htm",
          "image":"/316.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":317,
          "name": "Rangnath Dol",
          "text": "Rangnath Dol is a Hindu temple dedicated to the god Shiva on the bank of Joysagar Tank. It was built in 1703 by Sukhrungphaa near the main gateway on the way from the Joysagar tank to the Talatal Ghar. Large numbers of devotees continue to visit and offer puja in this temple. The sanctum of the temple enshrines a lingam. A do-chala mandapa is attached to the sanctum.",
          "history":"It bears the glorious history of Swargadeo Gadadhar Singha. Thow means row of houses and ra means people of Chutia Clan. Here the King established these people who were expert in gold and silver works. Located at a distance of 10.0 Kilometers from Sivasagar Town, this temple was built by Alon Burha Dehingia Borbarua in between 1683 and 1685 A.D during the reign of Ahom Swargadeo Gadadhar Singha.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3556.2181352772996!2d94.61987437544111!3d26.9599906766191!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3747311f088302e7%3A0x78cd481be09a402!2sRanganath%20Dol!5e0!3m2!1sen!2sin!4v1742361061089!5m2!1sen!2sin" ,
          "district":"Sivasagar",
          "website":"https://sivasagar.assam.gov.in/tourist-place-detail/331",
          "image":"/317.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":318,
          "name": "Rudreswar Temple",
          "text": "The Rudreswar Temple or Devaloya is a temple dedicated to Lord Shiva in the village of Rudreswar, under Sila Sindhurighopa Mouza (revenue circle), on northern bank of the river Brahmaputra, in North Guwahati. Built in 1749 CE by Ahom king Pramatta Singha, in memory of his father Swargadeo Rudra Singha, the temple is a fine example of a mixed style of Ahom-Mughal architecture.",
          "history":"In the latter part of his reign, Swargadeo Rudra Singha announced his desire to expand Assam westward as far as the river Karatoya in present-day West Bengal and Bangladesh, which was considered the frontier of the ancient Kamarupa kingdom.[5] Some sources also indicate that his ambition was to include a portion of the sacred Ganga river within his domain. Since Bengal was under the rule of the Mughals, he began to prepare for a massive military expedition against the Mughal Empire. An army of approximately 400,000 soldiers gathered in Guwahati, in which various tribes from the hills and plains came together, including the king of Cachar and the king of Jaintia from present day Meghalaya. His efforts were in vain. Before his preparations were completed he was seized with a mortal illness and died in August 1714 in his camp at Guwahati. His body was taken to Charaideo, in present-day Sivasagar District, for burial as per ancient Tai-Ahom custom. According to some sources, Rudra Singha was cremated according to Hindu customs in North Guwahati, while some denote only one of his small fingers was burnt in this way. His second son, Pramatta Singha, after ascending to the throne, decided to construct in Guwahati a temple to Lord Shiva in memory of his father. The site of his father's death was selected for the construction of the temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3743.6003887903566!2d85.91315487523515!3d20.23392018122396!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a19a1be62605f1d%3A0xdfc297ad4abff21e!2sRudreswar%20Temple%2C%20Brahman%20Suanlo!5e0!3m2!1sen!2sin!4v1742361227737!5m2!1sen!2sin" ,
          "district":"Kamrup",
          "website":"https://timesofindia.indiatimes.com/city/guwahati/revitalization-of-rudreswar-temple-a-blend-of-ahom-and-mughal-architecture/articleshow/113888667.cms",
          "image":"/318.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":319,
          "name": "Sivasagar Sivadol",
          "text": "Shiva dol (meaning the temple of Shiva) is a group of structures comprising three Hindu temples of Sivadol, Vishnudol (temple of Vishnu) and Devidol shrines, and a museum. These are located on the banks of the Sivasagar ('the ocean of the god Shiva') tank, also known as the Borpukhuri tank, in the heart of Sivasagar, in the Indian state of Assam. The tank was constructed between 1731 and 1738 and the temples were built in 1734 by Bar Raja Ambika, queen of Ahom king Swargadeo Siva Singha (1714-1744). The height of the Sivadol (dol means temple in Assamese) is 104 feet (32 m) and the perimeter is 195 feet (59 m) at the base. It is crowned with an 8-foot (2.4 m) high golden-dome.",
          "history":"Sivsagar, present day Sivasagar, was the capital of Ahom kingdom. The Ahoms had migrated from South China in 1228 and established their first capital at Charaideo 28 kilometres (17 mi) from present day Sivasagar in 1253. Initially they were / Ancestor worshippers close what we see in Taoism and Shinto, and very much a part of the practices till date Buddhists some of the practices of Mahayana and Theravada school of thoughts, though Hinduism came to prevail. It was the capital of the Ahom Kingdom till the British Raj was established in India. The tank was constructed between 1731 and 1738 and the temples were built in 1734 by Bar Raja Ambika, queen of Ahom king Swargadeo Siba Singha.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3555.3057851272624!2d94.63052807544213!3d26.988875176601884!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x37473145a137dee3%3A0xa1ef75a0eb570646!2sSiva%20Dol!5e0!3m2!1sen!2sin!4v1742361514752!5m2!1sen!2sin" ,
          "district":"Sivasagar",
          "website":"https://sivasagar.assam.gov.in/tourist-place-detail/275",
          "image":"/319.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":320,
          "name": "Sukreswar Temple",
          "text": "The Sukreswar Temple is an important Shiva temple in the state of Assam in India. The temple is located on the Sukreswar or Itakhuli hill on the south bank of river Brahmaputra in the Panbazar locality of Guwahati city. Leading down from the temple compound is a long flight of steps to the river. Sitting on the steps of Sukreswar ghat one can enjoy the scenery of sun setting on the river, boats moving across the river, people performing puja in honour of their relatives who have left this world, children and older people bathing. It has one of the largest Lingam of Lord Shiva.",
          "history":"It is believed to be constructed in 1744 by Ahom King Pramatta Singha (1744-1751). King Rajeswar Singha (1751-1769) who also promoted cause of the Saiva cult made financial provisions for the Sukreswar Temple in 1759.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3580.2736363514423!2d91.73858157541467!3d26.187775477086706!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a5a3baba3dddb%3A0x7e4712ec4aec479!2sSri%20Sri%20Sukreshwar%20Devalaya!5e0!3m2!1sen!2sin!4v1742361740721!5m2!1sen!2sin" ,
          "district":"Kamrup",
          "website":"https://www.mahashivratri.org/shiva-temples/sukreswar-temple.html",
          "image":"/320.jpg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":321,
          "name": "Tamreswari Temple",
          "text": "amreswari temple (also Dikkaravasini) is a temple for the tribal goddess called Kecaikhati is situated about 18 km away from Sadiya in Tinsukia district, Assam, India. The temple was in the custody of non-Brahmin tribal priests called Deoris. Some remains suggest that a Chutiya king built a wall or the temple itself in the year 1442. There were four different kinds of Deori priest who looked after the temple. The Bar Bharali and the Saru Bharali collected dues of the temple and provides animals for sacrifice. The Bar Deori (Deori Dema) and the Saru Deori (Deori Surba) performs the sacrifice and sung hymns. The temple was dedicated to Kechaikhati/Pishasi, a powerful tribal deity or the Buddhist deity Tara, commonly found among different Bodo-Kachari groups. The worship of the goddess even after coming under Hindu influence was performed according to her old tribal customs.",
          "history":" The temple is believed to have been constructed by the Chutia kings between the 13th and 14th centuries. The Chutia dynasty, one of the early rulers of Assam, were great patrons of Shakta (Goddess) worship.The temple is called Tamreswari because Tamra means 'copper' in Sanskrit, and Swari refers to the Goddess. Some historical accounts suggest that the temple once had a copper-plated roof, which is how it got its name.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3537.4976908311405!2d94.73453037438422!3d27.547060532544766!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x374094b095d31311%3A0xf9454d42c15bfca4!2sTameshwari%20Mandir%20Bormuria!5e0!3m2!1sen!2sin!4v1742362151002!5m2!1sen!2sin",
          "district":"Tinsukia",
          "website":"https://www.thehindubusinessline.com/blink/shoot/tamreswar-devalaya-in-assam-is-an-archaeological-gem/article32808140.ece",
          "image":"/321.jpeg",
          "state": "Assam",
          "country": "India"
        },
        {
          "t_id":322,
          "name": "Ugratara Devalaya",
          "text": "Ugratara Devalaya is a temple dedicated to Ugratara located in the western side of Jor Pukhury tanks in the heart of Guwahati city in the Lotaxil (Latasil) locality in Northeast India. The Ugratara Temple in Uzan Bazaar in the eastern part of Guwahati, Assam, is a Shakti shrine. Legend has said that the navel of Sati, first consort of Shiva, is related to this temple. Ugratara in Assam is generally identified with Tiksna-Kanta, Eka-Jata, etc., of the Buddhist pantheon.",
          "history":"Once upon a time, Yama (Lord of the Hell) made a complaint to Brahma that nobody is coming to Hell from Kamarupa because of the sacredness of the area, despite committing sins. Brahma carried this complaint to Vishnu. Vishnu took them to Shiva. Lord Shiva ordered Goddess Ugra Tara to drive away all the people who are living in Kamakhya. She sent her army.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3580.2260232960675!2d91.75091347541475!3d26.189324777085854!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x375a5a275efbfcfd%3A0x3bd71975118d8c64!2sSri%20Sri%20Ugratara%20Devalaya!5e0!3m2!1sen!2sin!4v1742362377359!5m2!1sen!2sin",
          "district":"Kamrup Metropolitan",
          "website":"https://kamrupmetro.assam.gov.in/tourist-place-detail/276",
          "image":"/322.jpg",
          "state": "Assam",
          "country": "India"
        }
      ] 
    },

    { 
      "id": 4, 
      "name": "Bihar",
      "temples":[
        {
          "t_id": 401,
          "name":"Aami Mandir",
          "text": "Aami Mandir, also known as Ambika Bhawani Temple is considered as a Shakti Peetha. It is a Hindu temple of the Goddess Sati, located at Ami, a prominent village in Dighwara of Saran District in Bihar, India.A very strange speciality is that this temple is situated at a place from where Lord Shiva's Pashupatinath temple in Kathmandu, Vishwanath temple in Varanasi and Baidyanath Dham in Deoghar are at an equal distance.",
          "history":"The temple's origins are deeply rooted in Hindu mythology. It is believed to be the Yagna Sthal of King Daksha, where Goddess Parvati, unable to bear the insult of her husband Lord Shiva, immolated herself in the sacred fire. This act led to Lord Shiva's cosmic dance of destruction, only to be pacified when Lord Vishnu dispersed Parvati's body parts across the land, creating the sacred Shakti Peethas.The Durga Saptashati narrates the story of Raja Surath and Samadhi Vaishya, who worshipped Goddess Durga at this very spot to fulfill their wishes, making it a significant place of devotion as described in Hindu scriptures.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3593.8994067387644!2d84.96171557539971!3d25.740839977365003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed52eb3ae453b1%3A0x309ad487cd7f69c6!2sAmbika%20Bhawani%20Temple%20Aami!5e0!3m2!1sen!2sin!4v1742366557369!5m2!1sen!2sin" ,
          "district":"saran",
          "website":"https://saran.nic.in/tourist-place/aami-temple/",
          "image":"/401.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 402,
          "name":"Baba Mukteshwar Dham",
          "text": "Baba Mukteshwarnath Dham is a godly sacred place of Hinduism dedicated to Lord Shiva In village Deohar, in the Indian state of Bihar. Baba Mukteshwarnath Dham is considered as one of the best temples in Deohar, Bihar.",
          "history":"According to religious beliefs, Baba Mukteshwarnath Dham has a history of about 200 years. Although there are many very important places in Mithilanchal (Bihar), which are completely neglected by historians and archaeologists, but the prevailing story traditions and folk beliefs about those places reveal their past. Shri Shri Baba Mukteshwar Nath Mahadev Temple is famous as Mukteshwar place, is a very historical and archaeological religious place.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14662999.536246259!2d70.73857958908572!3d26.202081932105738!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ee802fbf18f9c1%3A0x7172b449ac310fb6!2z4KSs4KS-4KSs4KS-IOCkruClgeCkleCljeCkpOClh-CktuCljeCkteCksOCkqOCkvuCkpSDgpKfgpL7gpK4sIEJhYmEgTXVrdGVzaHdhcm5hdGggRGhhbQ!5e0!3m2!1sen!2sin!4v1742366897600!5m2!1sen!2sin" ,
          "district":"Madhubani",
          "website":"https://timesofindia.indiatimes.com/travel/mukteshwar/mukteshwar-dham-temple/ps51780258.cms",
          "image":"/402.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 403,
          "name":"Baba Garibnath Dham",
          "text": "Baba Garibnath Dham is a Hindu holy place in Muzaffarpur in the Indian state of Bihar. Baba Garib Dham is one of the oldest temples dedicated to Shiva and known as the Deoghar of Bihar. Devotees from all across the district and state come here to pray and wish for their better life ahead. It is believed that prayer during the month of Sawan has special significance, which helps to fulfill all wishes.",
          "history":"According to religious beliefs, Baba Garibnath Dham has a history of about three hundred years. It is believed that earlier there was a dense forest and there were seven peepal trees in between. It is said that at the time of the cutting of these trees, blood-red substances started coming out and a huge lingam was found here. People tell that Baba appeared in the land owner's dream, since then worship is being here.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14329.720955565534!2d85.3819629544305!3d26.117511384078053!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed10f128f6e2c7%3A0x63d64bfc5f4188e2!2sShri%20Garib%20Nath%20Mandir(Muzaffarpur)!5e0!3m2!1sen!2sin!4v1742367073635!5m2!1sen!2sin" ,
          "district":"Muzaffarpur",
          "website":"https://acharyaganesh.com/temples/baba-garib-nath-mandir",
          "image":"/403.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 404,
          "name":"Bari Sangat Bihar",
          "text": "The Bari Sangat - Helabazar is a Hindu Sangat in the city of Hajipur, Bihar, India. It is said to have been built during the reign of the Ancient Indian civilization. This sanctimonious place was visited by many saints in ancient period to offer prayers, and it still has pious meaning to Hindu and Saints to this day,[1] being a destination for traveling devotees of Lord Rama and Lord Krishna. Sangat is a Hindu term with its origin in the Sanskrit word 'sangh', which means company, fellowship and association. In Hindu or Sanatan vocabulary, the word has a special connotation. It stands for the body of men and women who meet religiously, especially in the presence of the Guru or Saints.",
          "history":"Bari Sangat Temple in Patna has a rich history dating back to ancient times, with mentions in various historical texts and scriptures. The architecture and design of Bari Sangat Temple is a blend of various styles, showcasing intricate carvings and sculptures that reflect the cultural heritage of the region. The temple holds great significance in Hinduism, being dedicated to a revered deity and attracting devotees from far and wide for spiritual fulfillment. The temple hosts various festivals and celebrations throughout the year, drawing large crowds and adding to the cultural vibrancy of the area. Preservation and restoration efforts at Bari Sangat Temple are ongoing, with local authorities and community members working together to ensure the longevity of this historical site.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d926371.0541809961!2d84.334568446875!3d24.910363100000012!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f2fd96d4063a6d%3A0x2c43caaac08039d3!2sTHAKUR%20BARI%20SANGAT%20JHUNATHI%20ROHIT%20PANDEY!5e0!3m2!1sen!2sin!4v1742367410334!5m2!1sen!2sin",
          "district":"Vaishali",
          "website":"https://templeyatri.in/bari-sangat-temple-patna/",
          "image":"/404.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 405,
          "name":"Budhimai",
          "text": "Budhi Mai is a village in the Vaishali district, Bihar, India. It is a tourist destination with a rich a cultural and of historical heritage, and is a place of worship. The Budhi Mai Temple is situated in Vaishali, Haruli, Ismailpur, near the State Bank of India, Lalganj Road, Vaishali. Budhi Mai Fair/Mela ) is held in the month of July and August on Budhi Mai Campus, attracting visitors from all over Bihar.",
          "history":"Historians believe the city evolved as the first republic of the world during the 6th century consisting of a representative body that was elected. A really large pillar stands next to the brick stupa at Kolhua as a remembrance to the Buddha’s sermon and nirvana. Vaishali is a must visit place from religious, cultural & archeological viewpoint. The major attractions of Vaishali are Ashokan Pillar, Buddhi Mai, Buddha stupa, Raj Vishal ka Garh and so on. Vaishali is famous for Vaishali Mahotsava that celebrates the birthday of Lord Mahavira. Also, Sonepur fair is popular too that is held at a distance of 35 km from the city. Paintings, stone sculptures etc are other important attractions.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3593.1390648034567!2d85.18899872540054!3d25.765969827349227!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed5ca9997bc721%3A0x1742f0b08bf41c06!2sBudhi%20Mai%20Temple%2C%20Harauli%2C%20SH74%2C%20Bihar%20844125!5e0!3m2!1sen!2sin!4v1742370516385!5m2!1sen!2sin" ,
          "district":"Vaishali",
          "website":"https://www.templepurohit.com/hindu-temple/budhi-mai-mandir/",
          "image":"/405.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 406,
          "name":"Budhanath Temple",
          "text": "Baba Budhanath Temple also known as Vriddheshwarnath Temple is a Hindu temple devoted to Lord Shiva (Budhanath) and is situated on the Bank of River Ganga at Jogsar, Adampur, Bhagalpur, Bihar, India.",
          "history":"Budhanath Temple has a rich history, with roots tracing back to ancient times. It is said to have been constructed during the Mughal period, adding a layer of historical depth to its religious importance. The temple has been a center of spiritual activities for centuries and continues to be a major pilgrimage site in Bhagalpur.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3608.4707684112573!2d86.97218277538366!3d25.254744377673916!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f03539dc35a4d7%3A0xddb94b136283ae9f!2sBudhanath%20Temple!5e0!3m2!1sen!2sin!4v1742370784667!5m2!1sen!2sin",
          "district":"Bhagalpur",
          "website":"https://www.holidify.com/places/bhagalpur/budhanath-temple-sightseeing-1253438.html",
          "image":"/406.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 407,
          "name":"Maa Tara Chandi Temple",
          "text": "Maa Tara Chandi Temple is a Hindu temple dedicated to Maa Shakti or Maa Durga, located in Sasaram, Bihar, India. It is one of the 51 Shakti Peetha.",
          "history":"Maa Tarachandi Shakti Peetha, also called Maa Tarachandi, is the oldest and one of the most sacred temples of Sasaram. It is regarded as one of the 51 Siddha Shakti Pithas in India. Maa tara chandi is a kuldevi of the royal surwar rajput(gaur dynasty) who are presently living as a royal family of Namudag estate. According to Pauranic legends, the 'right eye' (Netra) of the corpse of Sati had fallen here when it was chopped off by Lord Vishnu with his 'Sudarshan Chakra'. The ancient temple, originally called Maa Sati, is believed to be the abode of the goddess Durga Maa Tara Chandi.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3618.3136953832836!2d84.04500517537289!3d24.921381277889587!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x398db11b5b311209%3A0x7e8f136d5233703a!2sMaa%20Tara%20Chandi%20Temple!5e0!3m2!1sen!2sin!4v1742371049100!5m2!1sen!2sin" ,
          "district":"Rohtas",
          "website":"https://rohtas.nic.in/tourist-place/maa-tara-chandi-temple/",
          "image":"/407.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 408,
          "name":"Chandika Sthan",
          "text": "Chandika Sthan is a Hindu temple situated in Munger, in the India state of Bihar. It is one of the fifty-one Shakti Peethas, places of worship consecrated to the goddess Shakti. On the Northeast corner of Munger, Chandika Sthan is just two kilometers away from the Munger town. Being a Siddhi-Peetha, Chandika Sthan is considered to be one of the most sacred and sanctified temples, as important as the Kamakshya temple near Guwahati. Sati's left eye fell here and it is believed that those who worship here get rid of eye pain. It is one of the major Hindu pilgrimage centre in Ang Pradesh region of Bihar.",
          "history":"Legendary tales and the Hindu folklore say that it was to save the world from the anger of Lord Shiva, as he took the corpse of Sati and wandered. The same legend says that the left eye of the Sati fell at Munger, which subsequently developed into a place of worship of the Divine Mother Chandi. Among the different Shakti peethas, Chandika Sthan is famous for the cure of eye troubles, as per the traditional belief of the local folklore.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3604.3689221569534!2d86.47837887538817!3d25.392458677585825!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f1ef225db6508d%3A0xab90a20fac1a4936!2z4KS24KSV4KWN4KSk4KS_4KSq4KWA4KSgIOCkruCkvuCkgSDgpJrgpILgpKHgpL_gpJXgpL4g4KSu4KSC4KSm4KS_4KSwLCBNdW5nZXI!5e0!3m2!1sen!2sin!4v1742371269232!5m2!1sen!2sin" ,
          "district":"Munger",
          "website":"https://www.templepurohit.com/hindu-temple/chandika-sthan/",
          "image":"/408.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 409,
          "name":"International Society for Krishna Consciousness (ISKCON)",
          "text": "International Society for Krishna Consciousness (ISKCON), commonly referred to as the Hare Krishna movement, is a Gaudiya Vaishnava Hindu religious organization. It was founded by A. C. Bhaktivedanta Swami Prabhupada on 13 July 1966 in New York City. ISKCON's main headquarters is in Mayapur, West Bengal, India and it claims approximately 1 million members globally.",
          "history":"ISKCON devotees follow a disciplic line of Gaudiya Vaishnavas and are the largest branch of Gaudiya Vaishnavism. Vaishnavism means 'worship of Vishnu', and Gauḍa refers to the area where this particular branch of Vaishnavism originated, in the Gauda region of West Bengal and Bangladesh. Gaudiya Vaishnavism has had a following in India, especially West Bengal and Odisha, for the past five hundred years. Gaudiya Vaishnavism was founded by Chaitanya Mahaprabhu, who rapidly spread his form of ecstatic bhakti (devotion) throughout Bengal. He established Sankirtan, the practice of publicly expressing devotion to Krishna, the Supreme God, through dance and song. This form of communal worship responded to rigid caste structures by engaging all people in worship regardless of caste and creed. Sri Chaitanya Mahaprabhu emphasized chanting the Hare Krishna Mahamantra (the 'great mantra'). He is considered by Gaudiya Vaishnavas to be an incarnation of Krishna himself.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3684293.602885529!2d80.5191639875!3d25.60681119999999!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed58ed6d09f60b%3A0x2bfe7fa6643c0a7!2sISKCON%20Temple%20Patna!5e0!3m2!1sen!2sin!4v1742371726790!5m2!1sen!2sin" ,
          "district":"Patna",
          "website":"https://iskconpatna.com/about/governance/",
          "image":"/409.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 410,
          "name":"Kapileshwar Temple",
          "text": "Kapileshwar Temple is situated in the Rahika region of Madhubani District, Bihar, India. A Shiva Linga was placed at this temple by the sage Kapila.[1] The site is located in the Rahika Vidhan Sabha constituency. This is one of the famous Shiva temples in Madhubani District. A large pond was dug outside the temple with the help of the Raj Darbhanga; from there, people took water for Jalabhishek. It is surrounded by villages like Kharaua, Rampur, and Jagat. In the month of Shrawan, people from different parts of Bihar gather for the Jalabhishek of Shivlinga.[2] The temple has a big boundary, and in the center of it, Lord Shiva temple is situated, whereas there are other temples also inside the boundary of it, like Parvati temple, Hanuman temples, etc. There are many sculptures here that are from history.",
          "history":"The history of tourism in Kapileshwar Sthan is intrinsically linked to the religious and spiritual importance of the site. The area is believed to be the abode of Lord Shiva, one of the principal deities in Hinduism. According to local beliefs, when Raja Janak of Mithila was ploughing the field, a â€˜Shivlingâ€™ (a representation of Lord Shiva) emerged from the ground, and Kapileshwar Sthan was established to honor this discovery. This ancient site is now home to the Shiva temple which attracts thousands of devotees, especially during Maha Shivaratri and other auspicious days in the Hindu calendar.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3661061.650518377!2d81.38627858750002!3d26.3505963!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39edcb456ac462b1%3A0x6561f0768ac7d8d4!2sKapileshwarnath%20Mandir!5e0!3m2!1sen!2sin!4v1742372156896!5m2!1sen!2sin",
          "district":"Madhubani",
          "website":"https://travelsetu.com/guide/kapileshwar-sthan-tourism/kapileshwar-sthan-tourism-history",
          "image":"/410.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 411,
          "name":"Khudneshwar Asthan Morwa",
          "text": "Khudneshwar Asthan is a Hindu temple devoted to Lord Shiva located 17 kilometers southwest of the Samastipur district headquarters of Bihar, India. The name of the temple was inherited from a Muslim woman named Khudni who found the Lingam at this location and became a devotee of Lord Shiva. Her mortal remains were buried one yard south beside the Lingam under the same temple roof.",
          "history":"During the British Empire, Narhan estate built this temple in 1858 and appointed a priest as a caretaker. Devotees flock there year round, but especially during its annual festival of Maha Shivratri and in the month of Shravan, crowds emerge for darshana and worship. In 2008 Bihar Religious Trust Board Chairman Kishore Kunal provided financial assistance from the board and announced it to be developed for tourists to demonstrate Hindu-Muslim unity.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3591.7499115272826!2d85.68994762540207!3d25.811823477320427!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed9b5d82086c75%3A0x77452788f4aad3f!2sRM6R%2BPVW%20Khudneshwar%20Asthan%2C%20Morwa%20North%2C%20Bihar%20848121!5e0!3m2!1sen!2sin!4v1742372563218!5m2!1sen!2sin" ,
          "district":"Samastipur",
          "website":"https://kaalchakra.in/khudneshwar-asthan-morwa-samastipur-bihar/",
          "image":"/411.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 412,
          "name":"Lal Keshwar Shiv Temple",
          "text": "The Lal Keshwar Shiv Mandir is a Hindu Temple in the city of Hajipur in Bihar, India.[1] Dedicated to Lord Shiva, it is located at Bagmusa (Hajipur), Vaishali. As per local folklore, it is said to have been in existence since ancient times and Lord Shiva is believed to be in the form of Lingam. Apart from anthropomorphic images of Shiva, the worship of Shiva in the form of a lingam, or linga, is also important. The worship of the Shiva-Linga originated from the famous hymn in the Atharva-Veda Samhitâ sung in praise of the Yupa-Stambha, the sacrificial post.",
          "history":" Local folklore suggests that the temple has ancient roots, with Lord Shiva worshipped here in the form of a Lingam. The temple is a significant spiritual center in the region, attracting devotees, especially on Mondays, which are considered auspicious for Lord Shiva.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1840956.623466948!2d84.17870384094961!3d25.68394139124845!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ee25e000ab0361%3A0xf15e02823ee32554!2sLaleshwar%20shiv%20mandir!5e0!3m2!1sen!2sin!4v1742372985108!5m2!1sen!2sin" ,
          "district":"Vaishali",
          "website":"https://www.iamsanatani.com/lal-keshwar-shiv-temple/",
          "image":"/412.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 413,
          "name":"Mahavir Mandir",
          "text": "Mahavir Mandir is a Hindu temple dedicated to the god Hanuman, located in Patna, Bihar, India. Millions of pilgrims visit the temple every year. Acharya Kishore Kunal is the secretary of the Mahavir Mandir Temple Trust, Patna. After the Vaishno Devi Temple, this temple has the highest earnings of over 1 lakh per day rendering its trust budgets as the second highest in the northern part of the country. The temple attracts huge crowds on festivals like Ramnavami. It is one of the leading temples dedicated to the worship of Lord Hanuman.",
          "history":"As per the Patna High Court judgment in 1948, the temple has existed since time immemorial. But due to the scrutiny of historical facts and traditions, it appears that this temple was originally established by swami Balanand, an ascetic of the Ramanandi sect in around 1730 CE. This temple gained popularity in 1947 with a large number of Hindu refugees coming to Patna after the partition of India. Subsequently, the temple was rebuilt as a concrete house, which was demolished in 1987 to construct a huge marble temple. The idol of Sankat-Mochan, an avatar of Hanuman, stands in it",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d230269.2031337842!2d84.97691194554977!3d25.606368366280783!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed585fff5af727%3A0xe553ec95b9179b2f!2sMahavir%20Mandir%20Patna!5e0!3m2!1sen!2sin!4v1742373328192!5m2!1sen!2sin" ,
          "district":"Patna",
          "website":"https://www.incredibleindia.gov.in/en/bihar/patna/mahavir-mandir",
          "image":"/413.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 414,
          "name":"Mangla Gauri Temple",
          "text": "The Mangla Gauri temple (Hindi: मां मंगलागौरी मंदिर) in Shakti Peetham, Gaya, Bihar, India was mentioned in Padma Purana, Vayu Purana and Agni Purana and Devi Bhagvata Purana and Markandeya Purana in other scriptures and tantric works. This temple is among the eighteen maha shaktipeeth. The present temple dates back to the 15th century. The shrine is dedicated to Sati or the Hindu Mother Goddess in the predominantly Vaishnavite pilgrimage center of Gaya.",
          "history":"Mangla Gauri Temple was built in the 15th century. The origins of Mangla Gauri Temple are steeped in mythology and folklore. Legend has it that this temple is one of the 51 Shaktipeeths, where parts of Goddess Sati's body fell during Lord Shiva's Tandava, the cosmic dance of destruction. As per the Bihar Tourism, Mangla Gauri Temple, built in the 15th century, is counted among the 52 Mahashaktipeeths dedicated to Goddess Sati where the body parts of Goddess Sati fell. The mother sitting on the hill is considered to be the goddess of benevolence.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3622.598219187006!2d84.99993587427792!3d24.774961248675464!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f32a355fb925b9%3A0x7e5d29cf476342e3!2sMaa%20Sarva%20Mangla%20Gauri%20Shakti%20Peeth%20Temple!5e0!3m2!1sen!2sin!4v1742376091976!5m2!1sen!2sin" ,
          "district":"Gaya",
          "website":"https://www.incredibleindia.gov.in/en/bihar/gaya/mangla-gauri-temple",
          "image":"/414.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 415,
          "name":"Mittheswarnath Shiv Temple",
          "text": "Mitheshwarnath Shiva Temple is a Hindu Temple, dedicated to Hinduism God 'Shiva'.[1] This temple is located at Chunabhatti Near Mitthu Mistri Chowk, Darbhanga District, Bihar, India. This temple built in the 20th century, as compared to Cornerstone of the Temple, and established by 'Mitthu Mistri Thakur' in March 1949. The name of the temple is originally denoted by 'Mitthu Mistri Thakur'. After the Death of Mitthu Mistri Thakur on 21 October 1982, this temple is Maintained by the Mitthu Mistri Thakur son's. Now, this temple is maintained and care by the 'Mitthu Mistri Thakur' Dynasty. Temples have on average a small number of visitors, usually local people per day, But during festivals like Maha Shivaratri, Shraavana, Naga Panchami, Kartik Purnima the number of visitors to the workplace and those who come to worship and pray to God Shiva are more.",
          "history":"This temple is about 71 years old if it is done from the established date. According to the foundation stone of this temple, the temple is built and established by 'Mitthu Mistri Thakur'. A Legend story is hidden between this temple. According to legend story told by 'Mitthu Mistri Thakur' Grandson 'J. M. Thakur', One day a sage came to Mitthu Thakur's house. Mitthu Thakur asked the sage, 'What do you want, Baba?'. The Rishi said, 'I am very hungry, give me something to eat. Mitthu Thakur said, Okay, you sit here and I bring you something to eat. Mitthu Thakur came to the house to arrange food for that Rishi, then it was mango season at that time, so Mitthu Thakur brought 'curd', 'flattened rice' and 'mango' for that Rishi in a plate.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1833385.4745443044!2d83.60193049375002!3d26.169632700000005!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39edb82033542a17%3A0x1f7489fc79bb39be!2sMittheshwarnath%20Shiva%20Temple!5e0!3m2!1sen!2sin!4v1742376715992!5m2!1sen!2sin" ,
          "district":"Darbhanga",
          "website":"https://www.iamsanatani.com/mittheswarnath-shiv-temple/",
          "image":"/415.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 416,
          "name":"Mundeshwari Temple",
          "text": "The Mundeshwari Devi Temple (IAST: Muṇḍeśvarī) is a Hindu temple, located at Ramgarh Village, 608 feet (185 m) on the Mundeshwari Hills of Kaimur plateau near Son River, in the Bhojpuri region of Indian state of Bihar. It is an Archaeological Survey of India (ASI) protected monument since 1915.",
          "history":"An inscription was found 'in debris around the temple', which mentioned year 30 (of an unknown era) and a local ruler Mahārāja Udayasena (otherwise unknown), and the form of the letters indicated a post-Gupta date. If the era being used was the regnal years of Emperor Harsha, it would yield a date of 636 CE. However, Neuss argues from the palaeography of the inscription that it was most likely written c. 570-590 CE. The inscription mentions the existence of some religious establishments which were existing there by this time.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3616.4877895597665!2d83.56210057537487!3d24.983535877849125!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x398e77bc22d30b09%3A0xf2c389e81820b357!2sMaa%20Mundeshwari%20Temple!5e0!3m2!1sen!2sin!4v1742377002795!5m2!1sen!2sin" ,
          "district":"Kaimur",
          "website":"https://tourism.bihar.gov.in/en/destinations/kaimur/mundeshwari-devi-temple",
          "image":"/416.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 417,
          "name":"Pataleshwar Mandir",
          "text": "The Pataleshwar Mandir is a Hindu Temple in the city of Hajipur, Bihar, India. Dedicated to Shiva, it is located at Jadhua Road, Hajipur. As per local folklore, it is said to have been in existence since ancient period and Lord Shiva is believed to be in the form of Lingam here. Apart from anthropomorphic images of Shiva, the worship of Shiva in the form of a lingam, or linga, is also important. The worship of the Shiva-Linga originated from the famous hymn in the Atharva-Veda Samhitâ sung in praise of the Yupa-Stambha, the sacrificial post.",
          "history":"This temple dating back to the 7th century AD is an iconic structure with history etched deep within. Carved out of a rock, its beautiful architecture and stone pillars have been lavishly embellished to demonstrates the creativity and passion of those responsible for building this temple. This temple, dedicated to Lord Shiva - an iconic Hindu deity revered throughout India - holds spiritual meaning for thousands of worshipers. An underground sanctuary thought to represent the underworld adds mystery and intrigue, prompting contemplation on more profound aspects of existence.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14997259.897878518!2d69.7413248828114!3d23.408453069539974!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bd4c0b599a3dbad%3A0x6e7eaaf61a38acce!2sPataleshwar%20Mahadev%20Mandir!5e0!3m2!1sen!2sin!4v1742377575391!5m2!1sen!2sin" ,
          "district":"Vaishali",
          "website":"https://www.incredibleindia.gov.in/en/chhattisgarh/bilaspur/pataleshwar-temple",
          "image":"/417.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 418,
          "name":"Patan Devi",
          "text": "Patan Devi, also called Maa Patneshwari, is the oldest and one of the most sacred temples of Patna, Bihar. It is regarded as one of the 51 Siddha Shakti Pithas in India. According to Puranic legends, the 'right thigh' of the corpse of Devi Sati had fallen here when it was chopped off by Lord Vishnu with his 'Sudarshan Chakra'. The ancient temple, originally called Maa Sarvanand Kari Patneshwari, is believed to be the abode of the goddess Durga.",
          "history":"According to the Hindu mythology, it is believed that the right thigh of Devi Sati fell in Magadh and it is said that the part of the body of Sati fell in both Maharajganj and Chowk areas in Old Patna city. At these places, the Badi Patan Devi temple and the Chhoti Patan Devi temple were built. According to the Tantra Charumani, the small images of the Bari Patan Devi Temple, Patna are the Goddess Mahakali, Mahalakshmi and Mahasaraswati. In Hindu mythology, these Goddesses protected Putraka, who was the founder of Pataliputra. A strange stone image has been found in a tank near the Bari Patan Devi Temple, Patna. That image has been kept in the eastern veranda of the main temple where this stone is being worshiped regularly.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3597.9966737287828!2d85.2036761753952!3d25.60502677745072!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed5f40e00e8dbf%3A0xcccfe0777c1e2465!2sShri%20Badi%20Patan%20Devi%20Temple%2C%20Patna!5e0!3m2!1sen!2sin!4v1742377741068!5m2!1sen!2sin" ,
          "district":"Patna",
          "website":"https://tourism.bihar.gov.in/en/destinations/patna/badi-patan-devi",
          "image":"/418.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 419,
          "name":"parasmaninath temple ",
          "text": "Parasmaninath Temple, also known as Parasmanidham Rahua Sangram, is a renowned Hindu temple dedicated to Lord Shiva. Situated in the Madhubani district of Bihar, India, the temple holds significant religious and cultural importance.",
          "history":"The temple's origins are steeped in local folklore and mythology, with its roots believed to go back centuries. While its exact historical timeline is unclear, the temple has long been a place of devotion and spiritual practice. ",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3585.1898488692473!2d86.22944957540926!3d26.027343577185945!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39eddf00441112df%3A0x3a984971b1ac45fd!2sParasmaninath%20Temple!5e0!3m2!1sen!2sin!4v1742378089390!5m2!1sen!2sin" ,
          "district":"Madhubani",
          "website":"https://www.iamsanatani.com/parasmaninath-temple/",
          "image":"/419.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 420,
          "name":"Ramchaura Mandir",
          "text": "The Ramchaura Mandir is a Hindu temple in the city of Hajipur, Bihar, India. Dedicated to the god Rama, it is located at Rambhadra near Helabazar. According to local folklore, Rama is believed to have visited this place on his way to Janakpur; leaving his footprints here, which are worshiped as the central icon.",
          "history":"Local folklore suggests that the temple has existed since the time of the Ramayana. It is believed that Lord Rama visited this site on his way to Janakpur, leaving his footprints, which are now enshrined and worshipped within the temple. The temple holds significant religious value, especially during Rama Navami—the birth anniversary of Lord Rama—when a fair is organized, attracting numerous devotees.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3595.8207591269097!2d85.20355987539762!3d25.67723577740511!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed5ea0c19226ff%3A0x37df15f558d4409d!2sRamchaura%20Temple!5e0!3m2!1sen!2sin!4v1742386019822!5m2!1sen!2sin" ,
          "district":"Vaishali",
          "website":"https://www.tripuntold.com/bihar/vaishali/ramchaura-mandir/",
          "image":"/420.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 421,
          "name":"Shitala Mata Temple",
          "text": "Shitala Mata Mandir or Shitala Devi Mandir is a temple of Shitala Mata situated at Patna City, Patna in Bihar state of India. This is place for worship of Mata Durga also known as shakti peeth of Maa Durga.",
          "history":"Devotees visit the temple seeking blessings for health and protection against diseases. The temple becomes particularly significant during the festival of Sheetala Ashtami, observed on Krishna Ashtami in the month of Chaitra (March-April), dedicated to Goddess Shitala.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1841906.8209757565!2d82.82637189374996!3d25.622380699999994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39ed584ebe730593%3A0x27e01d541328c626!2sSheetla%20Mata%20mandir!5e0!3m2!1sen!2sin!4v1742386852669!5m2!1sen!2sin" ,
          "district":"Patna",
          "website":"https://www.templepurohit.com/hindu-temple/shitla-mata-mandir-bihar/",
          "image":"/422.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 422,
          "name":"Shri Adinath Akhara",
          "text": "Shri Adinath Akhara, is an ashram dedicated to Shiva. It is situated 1.5 km from the Buxar railway station at the confluence of the Ganga and Sone canals",
          "history":"Siddhashrm is a very ancient name of Charitravan. It is mentioned as a pilgrimage in ancient Hindu scriptures including Shrimad Valmiki Ramayana, Shiva Purana, Vishnu Purana, Narada Purana and Agni Purana. Chaurasi (Eighty-four) Navnath Siddhas spent a term of penance there, as authenticated by disc-bearing statues excavated there. Its re-emergence was initiated by Shri Adinath Peethadheeshwar Shri Trilokinathjee Maharaj (Shri Nath Baba jee) in 1964. A temple was constructed and in 1967 idols were installed and Yajna was conducted. Shri Adinath Akhara was formally inaugurated in Prayag Kumbh in 1977 by performing Maharudra Yajna.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7076997.522380348!2d68.97076997500001!3d29.991923400000008!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x390947dd38631e2b%3A0x2ad6c9fbab9aaea6!2sShri%20Adinath%20Akhara%2C%20Shri%20Sheedlok%20Ashram!5e0!3m2!1sen!2sin!4v1742395253276!5m2!1sen!2sin",
          "district":"Buxar",
          "website":"https://x.com/udaypratapbuxar/status/1562463512395259904",
          "image":"/422.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 423,
          "name":"Sita Kund",
          "text": "Sita Kund is a Hindu pilgrimage site that honours the birthplace of the goddess, Sita. The Punaura Dham Janki Mandir is a Hindu pilgrimage site in Sitamarhi district, Bihar, which has an ancient Hindu temple. It is situated 5 km west of Sitamarhi City and a popular visitor's attraction.",
          "history":"Sita Kund is a place which is associated with the classic Ramayana. According to Hindu mythology, Rama and Sita had come to Ayodhya Hills and stayed during their exile. Sita was thirsty and Ram pierced an arrow through the Earth’s soil crust and through that pristine fresh water springs and streams gushed out. Sita quenched her thirst. The place is known as Sita-kunda.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14838217.842826048!2d66.55852455000003!3d24.774496600000017!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f32a2cd61e41c5%3A0xddb3568673191112!2sSita%20Kund!5e0!3m2!1sen!2sin!4v1742395570022!5m2!1sen!2sin" ,
          "district":"Sitamarhi",
          "website":"https://www.incredibleindia.gov.in/en/bihar/gaya/sita-kund",
          "image":"/423.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 424,
          "name":"Thawe Mandir",
          "text": "Thawe Mandir, the Temple of Maa Thawewali is situated in Thawe, in Gopalganj District in the State of Bihar, India. It is only 6 km from Gopalganj town on the Gopalganj-Siwan National Highway. A village is situated 6 km from District headquarters in the south-west direction where there is a junction station “Thawe” of the northeastern railway of the Masrakh-Thawe section and the Siwan-Gorakhpur loop-line.",
          "history":"In the village, there is an old fort, but the history of the fort is obscure. The King of Hathwa had a palace there but it is now in a decadent state. Close by the residence of the Hathwa Raja, there is an old temple dedicated to Goddess Durga. Within the enclosure of the temple, there is a peculiar tree, the botanical family of which has not yet been identified. The tree has grown up like the cross. Various legends are prevalent in connection with the idol and the tree. A big fair is annually held in the month of Chaitra (March-April). ",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3572.8049622162325!2d84.39246507542286!3d26.429769876938416!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3993046015475947%3A0xa02174d301a4c584!2sThawe%20Mandir!5e0!3m2!1sen!2sin!4v1742437125375!5m2!1sen!2sin" ,
          "district":"Gopalganj",
          "website":"https://tourism.bihar.gov.in/en/destinations/gopalganj/thawe-mandir",
          "image":"/424.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 425,
          "name":"Ugna Mahadev, Bhawanipur",
          "text": "Ugna Mahadev Mandir is a Hindu temple in Bhawanipur village of Madhubani district in the Mithila region of Bihar in India. The temple is located at 14 km from Madhubani and 180 km away from Patna. It is believed to be the place where Lord Shiva showed his original form to the Maithili Mahakavi Vidyapati. Ugna was incarnation of Lord Shiva as a servant of his favorite devotee and great Maithili poet Vidyapati.",
          "history":"Once there was a very big devotee if Lord Shiva named vidyapati. He lived in Bihar in his small house. Mahadev was so pleased of him that he himself came at his home to live with Vidyapati. Shiva transformed himself into a normal human and came to Vidyapati's house. Shiva told his name as Ugna and said that he want the job of the servnt at his home. At that time, Vidyapati's financial condition was not so good that's why he refused. But as Shiva wanted to live with his devotee that why doing his Leela he began pleading and begging to Vidyapati like a normal human being. At last Vidyapati agreed with the salary of giving two meals in a day. So Shiva started living at his house as Ugna. Once Vidyapati and Ugna were walking in a jungle when Vidyapati ordered Ugna to fetch water from anywhere or else he(Vidyapati) will die of thirstiness. Ugna obeying the order went somewhere else, opened his jata, took gangajal and gave it to Vidyapati. Vidyapati drank the water and had a relief. But he was amazed as there was no source of water around and the water was tasting like gangajal. He asked Ugna to tell his real identity but Ugna said there same thing. At last Vidyapati fell on the gets off mahadev and started saying sorry as he behaves with the Lord like if he was his servent. Now mahadev had to come in his real form. So he asked Ugna to not to tell anyone about this and if he will tell them mahadev will not live with him and return. Vidyapati was now on the 7th sky as the Lord of the Lords Shiva was living with him. So he kept this a secret and didn't even tell it to his wife. So once Vidyapati was gone for some work that time Shiva did a mistake ( Because if he will be perfect in everything then the people might doubt him). The angry wife of Vidyapati took a stick from the stove and started beating Ugna. ",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3578.487188491552!2d86.09671567541663!3d26.24584717705096!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39edd1ddd2df26b1%3A0x630a30fc56a92e42!2sUgna%20Mahadev%20Mandir!5e0!3m2!1sen!2sin!4v1742437596299!5m2!1sen!2sin" ,
          "district":"Madhubani",
          "website":"https://bhagwanshivamahadev.quora.com/Story-of-Ugna-Mahadev",
          "image":"/425.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 426,
          "name":"Viraat Ramayan Mandir",
          "text": "Viraat Ramayan Mandir is a under-construction Hindu temple, located at twin villages of Kaithawalia and Bahuara near Chakia in East Champaran district, Bihar, India. It is being built with a cost of 500 crore rupees and is planned to be 123 metres (405 ft) high, double height of Angkor Wat Hindu Temple in Cambodia, and to have a hall that seats 20,000 people.",
          "history":"The temple is inspired from Angkor Wat of Cambodia and Ramanathaswamy Temple of Rameshvaram and Meenakshi Sundareshvara Temple of Madurai in Tamilnadu. The temple will comprise 18 shrines for various Hindu deities; Rama and Sita being the principal deities. The plan is spearheaded by Acharya Kishore Kunal.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3574.2280511809654!2d84.93220777542132!3d26.383818976966424!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39932a2f00000001%3A0xdcef5da7a9bf88b2!2sViraat%20Ramayan%20Mandir!5e0!3m2!1sen!2sin!4v1742437826248!5m2!1sen!2sin" ,
          "district":"East Champaran",
          "website":"https://currentaffairs.adda247.com/worlds-largest-ramayan-temple-in-bihar-to-be-completed-by-2025/",
          "image":"/426.jpeg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 427,
          "name":"Vishnudham Mandir",
          "text": "Vishnudham is a prominent temple with 2nd largest Idol of Lord Vishnu in the world, situated in Samas, Bihar. It is just second to Lord Venkatesh idol of Tirupati. Where a statue of Vishnu was discovered in 1992 in the same pond on which bank it is situated. Samas village is situated in Barbigha block of the Sheikhpura district. The was constructed in South Indian architecture by local villagers and authorities, at the site of the statue.",
          "history":"This ancient idol was buried under the soil for centuries in the vast reservoir of Gram Samas. Only its aura was visible. It was worshipped as the village deity known as 'Silbaba.' On July 5, 1992, during the month of Ashadha, on the Shukla Panchami Sunday, some people unearthed this magnificent idol of Lord Vishnu from the soil. Due to our deeply religious social structure, a large crowd of devotees gathered spontaneously. On this occasion, a grand fair was held at the fort for three months. With the help of the villagers, the idol was installed, and formal worship began. Along with this, the process of temple construction also commenced. The then administrative officials also visited the site for inspection.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3582.7879209623047!2d84.5851768754119!3d26.105840777137328!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3992e81a5420c115%3A0xd2430afd691de980!2sSri%20Vishnudham%20Mandir!5e0!3m2!1sen!2sin!4v1742438341440!5m2!1sen!2sin" ,
          "district":"Sheikhpura",
          "website":"https://www.templepurohit.com/hindu-temple/vishnudham-mandir/",
          "image":"/427.jpg",
          "state": "Bihar",
          "country": "India"
        },
        {
          "t_id": 428,
          "name":"Vishnupad Temple, Gaya",
          "text": "Vishnupad Temple is a Hindu temple dedicated to Vishnu in Gaya, Bihar, India, located on the banks of Phalgu river. The temple is believed to be built upon the site where Vishnu had purportedly killed the demon Gayasura or pinned him underground. The temple features a 40-cm footprint purported to be of Vishnu incised into a block of basalt, known as Dharmasila which was retained when the deity stepped on Gayasura's chest before pinning him underground.",
          "history":"The construction date of temple is unknown and it is believed that Rama along with Sita had visited this place. The present day structure was rebuilt by Devi Ahilya Bai Holkar, the ruler of Indore, in 1787, on the banks of the Falgu river. Ahilyabai Holkar had crafted the temple, sent her officers to inspect and find the best stone for the temple in whole region, and they finally found munger black stone as the best choice in Jaynagar. Since there was no proper road and the mountains were very far from Gaya, the officers found another mountain where they can carve and easily bring the stone to Gaya the place was near Bathani. The officers brought the craftsmen from Rajasthan. They started carving the temple in Patharkatti. The final temple was assembled in Gaya near Vishnupad temple site. After the completing the construction of temple many craftsmen returned to their native places, but some of them settled-down in Pattharkatti village itself. Bihar government has marked this place as one of the prominent tourist spots of Bihar. The 1000 stone steps leading to the top of the Brahmajuni hill on southwest of the Vishnupad mandir gives the view of Gaya city and the Vishnupad temple, which is a tourist spot. There are also many small temples near this temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3622.526957680145!2d85.00668037536819!3d24.777403177983643!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39f32b956601d2c3%3A0x87018dc46f7c53de!2sShri%20Vishnupad%20Temple%2C%20Gaya!5e0!3m2!1sen!2sin!4v1742439113037!5m2!1sen!2sin" ,
          "district":"Gaya",
          "website":"https://tourism.bihar.gov.in/en/destinations/gaya/vishnupad-temple",
          "image":"/428.JPG",
          "state": "Bihar",
          "country": "India"
        }
      ]
    },

    { 
      "id": 5, 
      "name": "Chandigarh",
      "temples":[
        {
          "t_id":501,
          "name":"Chandi Mandir",
          "text": "Chandi Mandir is a Hindu temple dedicated to Chandi the goddess of power, near Chandigarh, located on NH-5 Chandigarh-Kalka highway in Panchkula city of Haryana state of India. It is about 15 km from the city of Chandigarh, which was named after the temple, and about 10 km away from the Mansa Devi Shrine. The temple is situated amidst beautiful surroundings and the backdrop of the Shivalik hills.",
          "history":"This ancient temple is known to get rid of evil spirits. Chandi pooja is the popular ritual of this temple. Many devotees come to perform Chandi pooja. The Prasad of the temple is another popular thing that attracts the devotees and the aarti is another attraction of this temple.  The best time to visit this temple is during the Maha aarti.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d13718.298812386976!2d76.88200515712681!3d30.73035454336307!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x390f93b5275c536b%3A0x93743187dbe79475!2sChandi%20Mandir%2C%20Haryana!5e0!3m2!1sen!2sin!4v1742208207990!5m2!1sen!2sin",
          "district":"Panchkula",
          "website":"https://indiano.travel/place/chandi-mandir-chandi-the-goddess-of-supreme-power/",
          "image":"/501.jpg",
          "state":"Chandigarh",
          "country":"India"
        }
      ]
    },

    { 
      "id": 6, 
      "name": "Chhattisgarh",
      "temples":[
        {
          "t_id": 601,
          "name":"Ashtabhuji Temple",
          "text": "Ashtabhuji Temple is a Hindu Shaivist temple located in Adbhar, Janjgir-Champa district, Chhattisgarh, India.Ashtabhuji Temple",
          "history":"he name Ashtabhuja comes from the fact that the goddess had eight hands or Bhuja. She was the daughter of Yashoda- the foster mother of Lord Krishna. There is a temple dedicated to her at Vindhyachal where devotees flock every year to celebrate her greatness. The temple is situated atop the Vindhya mountain range. It is believed, that she came here, after relieving herself from the grip of the demon Kansa, who wanted to kill her, just after her birth to Vasudeva and Devaki.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3611.1877255655777!2d82.46934678885498!3d25.163138399999994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x398febbc44318771%3A0x49fa94d3c774102d!2sMaa%20Ashtabhuja%20Devi%20Temple%2C%20Vindhyachal!5e0!3m2!1sen!2sin!4v1742441302519!5m2!1sen!2sin",
          "district":"Janjgir-Champa",
          "website":"https://vindhyachalmandir.com/ashtabhuja-devi-temple-vindhyachal/",
          "image":"/601.jpg",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 602,
          "name":"Bambleshwari Temple",
          "text": "Bambleshwari Temple is a Hindu temple, located at Dongargarh in Rajnandgaon district, Chhattisgarh, India. It is on a hilltop of 1600 feet. This temple is referred as Badi Bambleshwari. Another temple at ground level, the Chhotti Bambleshwari is situated about 1/2 km from the main temple complex. These temples are revered by lakhs of people of Chhattisgarh who flock around the shrine during the Navratris of Kavar (during Dusshera) and Chaitra (during Ram Navami). There is tradition of lighting Jyoti Kalash during Navaratris here.",
          "history":"The history of the Bambleshwari Temple can be traced back to ancient times, although there is no concrete evidence of its construction or establishment. According to legend, the temple was built by King Vikramaditya of Ujjain, who was a devotee of the goddess. It is also believed that the Pandavas, the protagonists of the Hindu epic Mahabharata, visited the temple during their exile.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3720.341057669845!2d80.74799757526067!3d21.178606280508525!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3a2be0e3639a1989%3A0x4b3d9a3307e38b16!2sMaa%20Bamleshwari%20Temple!5e0!3m2!1sen!2sin!4v1742457595828!5m2!1sen!2sin" ,
          "district":"Rajnandgaon",
          "website":"https://sacredsites.com/asia/india/bambleshwari_temple_information.html",
          "image":"/602.jpg",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 603,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 604,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 605,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 606,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 607,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 608,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 609,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 610,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 611,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 612,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 613,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 614,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        },
        {
          "t_id": 615,
          "name":"",
          "text": "",
          "history":"",
          "iframeURL":"",
          "district":"",
          "website":"",
          "image":"",
          "state": "Chhattisgarh",
          "country": "India"
        }
      ]
    },
    { "id": 7, "name": "Delhi" },

    { 
      "id": 8, 
      "name": "Goa",
      "temples":[
        {
          "t_id":801,
          "name":"Mahadev Temple, Tambdi Surla",
          "text": "Mahadeva Temple, Tambdi Surla is a 13th-century Hindu temple in the Kadamba style dedicated to Lord Shiva, one of the main deities in Hinduism, and is an active place of Hindu worship. It is an ASI protected Monument of National Importance in Goa. The temple is dedicated to Lord Shiva and is reminiscent of the temples at Aihole in neighbouring Karnataka.",
          "history":"The temple was built in the Kadamba style from basalt, carried across the mountains from the Deccan plateau and carved by craftsmen. It is considered to be the only specimen of Kadamba architecture in basalt stone preserved and available in Goa. The temple survived the Islamic invasions and the Goa Inquisition, due to its remote location in a clearing deep in the forest at the foot of the Western Ghats which surround the site.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3845.8424977248133!2d74.24998217512277!3d15.439049885152794!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bbf084e06883729%3A0x492ac4c792d0417a!2sKadamba%20Shri%20Mahadeva%20Temple%2C%20Tambdisurla!5e0!3m2!1sen!2sin!4v1742208591104!5m2!1sen!2sin",
          "district":"South Goa",
          "website":"https://map.sahapedia.org/article/Tambdi-Surla-Temple/1850",
          "image":"/801.jpg",
          "state":"Goa",
          "country":"India"
        },
        {
          "t_id":802,
          "name":"Mandodari Temple, Betki",
          "text": "Shri Mandodari temple is a Hindu temple in the village of Betki,about 5 km from Marcel, Ponda in Goa, India. The temple is located at 81 ft elevation. Temple is known for the miracles of Water Goddess Mandodari and sacrifice made by the villagers. Water Goddess, Mandodari is the chief deity of the temple",
          "history":"This is a temple for Mandodari the gramadevata or the village deity of Betki. It is not a temple for Ravana's wife Mandodari.The name 'Mandodari' is from the words mand (water) and udar (stomach). It means someone who is born in the water. This temple was built to worship the great human beings whose children were sacrificed in the past to ensure that this village had a flowing stream of water[citation needed]. There is no well water in Betki village so the main source of water in this area is streams. This is how the village started worshiping this deity.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3844.60318117275!2d73.98734697512411!3d15.505762485095003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bbfbcfa0945efe5%3A0x491f29fbbf7ee144!2sShri%20Mandodari%20Devi%20Temple%2C%20Betki!5e0!3m2!1sen!2sin!4v1742208974480!5m2!1sen!2sin",
          "district":"Ponda(North Goa)",
          "website":"https://meghablogs.com/en/mandodari-temple-betki-goa/",
          "image":"/802.JPG",
          "state":"Goa",
          "country":"India"
        },
        {
          "t_id":803,
          "name":"Shri Damodar Sansthaan",
          "text": "Shri Damodar Temple Zambaulim or Shri Damodara Sansthaan is a Hindu temple on the bank of the Kushawati River near the village of Zambaulim 22 km from the city of Margao on the border of Quepem region (Quepem taluk) in the south of Goa. The temple houses a celebrated murti, or image, of Shiva incarnated as Damodar.",
          "history":"The deity was originally based in a temple in Mathagam, now Madgaon or Margao, where the Holy Spirit Church now stands. Due to the temple destruction campaign started by the Portuguese rulers in Sasashti Taluka in the year 1567, the Mahajans from Madgaon shifted the local deities (Ramnath, Damodar, Laxmi-Narayan, Chamundeshwari, Mahakali, Mahesh, etc.) to Zambaulim. The Desais of Rivona helped the Mahajans and gave them land for the construction of temples as well as Vatan which is being paid even today.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3850.4841921619372!2d74.09242047511766!3d15.186646285372136!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bbe533c2b6b3d77%3A0xdd98e93187faa1c1!2sShree%20Ramnath%20Damodar%20Sansthaan%2C%20Goa!5e0!3m2!1sen!2sin!4v1742209264408!5m2!1sen!2sin",
          "district":"South Goa",
          "website":"https://belezagoa.com/tourism-in-goa/shri-damodar-temple-zambaulim/",
          "image":"/803.jpg",
          "state":"Goa",
          "country":"India"
        }
      ]
    },

    { "id": 9, "name": "Gujarat" },
    { "id": 10, "name": "Haryana" },
    { "id": 11, "name": "Himachal Pradesh" },

    { 
      "id": 12, 
      "name": "Jammu and Kashmir",
      "temples":[
        {
          "t_id": 1201,
          "name":"Raghunath Temple",
          "text": "Raghunath Temple is a Hindu temple located in Jammu in the Indian union territory of Jammu and Kashmir. It consists of a complex of seven Hindu shrines. Raghunath Temple was constructed by the first Dogra ruler Maharaja Gulab Singh in the year 1835 and later his son Maharaja Ranbir Singh got it completed in the year 1860 during Dogra rule.[1] The temple has many gods in its complex of shrines, but the presiding deity is Rama - also known as Raghunath, an Avatar of Vishnu.",
          "history":"During the reign of the rulers of Jammu Shivaliks, after 1765, there was a spurt in temple building activity in Jammu area, which continued during the early period of the 19th century. The rulers built spiral shaped temples with brick and crowned each tower with bright Kalashas in the shape of shikhara (rising tower). One such temple complex was started in 1822 by Gulab Singh, the ruler of Jammu and was dedicated to his guru Baba Prem Das. Its construction was completed in 1860 by his son Maharaja Ranbir Singh. However, according to an inscription in Brahmic script (Takri) at the entrance of the temple, Gulab Singh and his brother Dhyan Singh are credited with building the temple in 1827 in honour of Mahant Jagannath.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d13747514.590544673!2d56.40494685!3d32.73051190000002!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x391e856f8a2dac73%3A0xe98e876f075b1cc0!2sShri%20Raghunath%20Temple%2C%20Jammu!5e0!3m2!1sen!2sin!4v1742468034060!5m2!1sen!2sin" ,
          "district":"Jammu",
          "website":"https://jammu.nic.in/tourist-place/raghunath-temple-jammu/",
          "image":"/1201.JPG",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1202,
          "name":"Vaishno Devi Temple",
          "text": "Vaishno Devi Temple, also known as the Shri Mata Vaishno Devi Temple and Vaishno Devi Bhavan, is a Hindu temple located in Katra, Jammu and Kashmir, dedicated to Vaishno Devi, a manifestation of Mahakali, Mahalakshmi, and Mahasarasvati. It is located on the Trikuta mountain at 5,000 feet / 1,500 meters elevation. The Shakti tradition considers it to be a Shakti Pitha. The temple is governed by the Shri Mata Vaishno Devi Shrine Board (SMVDSB) and has been chaired by the Governor of Jammu and Kashmir since August 1986.",
          "history":"Although the Vaishno Devi temple is now the most popular Devi shrine in the region, its popularity is relatively recent. In 1971, when Inderjit Bhardwaj did a study of Devi shrines in the Siwalik mountains, he did not mention the Vaishno Devi temple as particularly important. Its popularity increased rapidly after an expansion was done in 1976 so that it could accommodate up to 5,000 visitors per day. By 1981, annual visitors to the shrine were about 900,000; by the early 1990s, the number had increased to over 3 million, and the Vaishno Devi temple had become by far the most popular Devi temple in the region. By 2007, the annual number of pilgrims was about 7.5 million. In June 2007, in order to reduce congestion and improve security, the Shrine Board reduced the limit on the number of visitors allowed per month.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d14836337.554374857!2d64.96847156526847!3d24.790223429507733!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x391e786b6985aaad%3A0xa04ab611af048191!2sVaishno%20Devi!5e0!3m2!1sen!2sin!4v1742468301475!5m2!1sen!2sin",
          "district":"Reasi",
          "website":"https://www.maavaishnodevi.org/",
          "image":"/1202.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1203,
          "name":"Amarnath Temple",
          "text": "Amarnath Temple is a Hindu shrine located in the Pahalgam tehsil of the Anantnag district of Jammu and Kashmir, India. It is a cave situated at an altitude of 3,888 m (12,756 ft), about 168 km from Anantnag city, the district headquarters, 141 km (88 mi) from Srinagar, the summer capital of Jammu and Kashmir, reached through either Sonamarg or Pahalgam. It is an important shrine in Hinduism.",
          "history":"The book Rajatarangini refers to Krishaanth or Amarnath. It is believed that in the 11th century CE, Queen Suryamati gifted trishulas, banalingas and other sacred emblems to this temple. Rajavalipataka, begun by Prajna Bhatta, contains detailed references to the pilgrimage to Amarnath Cave Temple. In addition, there are further references to this pilgrimage in many other ancient texts.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3299.2869131720654!2d75.50154517572342!3d34.21569177309593!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38e24fca96056755%3A0xdfd15d625912515e!2sShri%20Amarnath%20Cave%20Temple!5e0!3m2!1sen!2sin!4v1742472014554!5m2!1sen!2sin" ,
          "district":"Anantnag",
          "website":"https://jksasb.nic.in/",
          "image":"/1203.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1204,
          "name":"Hari Parbat",
          "text": "Hari Parbat, also called Koh-i-Maran, is a hill overlooking Srinagar, the largest city and the capital of Jammu and Kashmir, India. It is the site of the Hari Parbat fort, built by the Durrani Empire, and of a Hindu temple, mosques, and gurdwara.",
          "history":"ari Parbat is also known as Kooh-e-Maran lies on the west of Dal Lake in Srinagar, in the UT of Jammu & Kashmir. This Mughal structure was built by an Afghan Governor Atta Mohammed Khan in 18th century. Later a long wall was constructed in 1590 by Emperor Akbar. Surrounded by commendable structures from all religions, this fort sits at the top giving a spectacular view of Dal Lake.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3303.5836013864196!2d74.81392997571879!3d34.10580617313677!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38e185726f612dbd%3A0x3ab1516f0503ffb6!2sHari%20Parbat!5e0!3m2!1sen!2sin!4v1742472208034!5m2!1sen!2sin" ,
          "district":"Srinagar",
          "website":"https://srinagar.nic.in/tourist-place/hari-parbat-fort/#:~:text=Hari%20Parbat%20is%20also%20known,in%201590%20by%20Emperor%20Akbar.",
          "image":"/1204.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1205,
          "name":"Kheer Bhawani Temple",
          "text": "Kheer Bhawani, Ksheer Bhawani or the Ragnya Devi temple[a] is a Hindu temple situated at a distance of 25 kilometres (16 mi) north-east of Srinagar, Jammu and Kashmir, India, in the village of Tulmulla in Ganderbal. It is dedicated to the Hindu goddess Kheer Bhavani constructed over a sacred spring. As is the custom with Hindu deities, the goddess has many names including Ragnya or Rajna, along with variations in honorifics such as Devi, Mata or Bhagavati. The term kheer refers to a milk and rice pudding that is offered to propitiate the goddess. Kheer Bhawani is sometimes translated as 'Milk Goddess'. The worship of Kheer Bhawani is universal among the Hindu Kashmiris, most of them who worship her as their protective patron deity Kuladevi.",
          "history":"The mention of Kheer Bhawani is found in Kalhana's Rajtarangini. Kalhana writes that the sacred spring of Tula Mula is situated in a marshy ground. Thousands of years ago, floods inundated the spring and temple. Kashmir's Yogi Krishna Pandit Taploo of Bohri Kadal, Srinagar had a dream in which the Goddess appeared to him and directed him to the location of the holy spring. It is also mentioned in the Bhrigu Samhita.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3299.083202451937!2d74.72820577572372!3d34.220893873093964!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38e19da6fe2d0dfb%3A0xcbd5d2afee07de5d!2sSri%20Kheer%20Bhawani%20Durga%20Temple!5e0!3m2!1sen!2sin!4v1742472434789!5m2!1sen!2sin" ,
          "district":"Ganderbal ",
          "website":"https://ganderbal.nic.in/tourist-place/kheer-bhawani-temple/",
          "image":"/1205.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1206,
          "name":"Martand Sun Temple",
          "text": "Martand Sun Temple is a Hindu temple located near the city of Anantnag in the Kashmir Valley of Jammu and Kashmir (union territory), India. It dates back to the eighth century CE and was dedicated to Surya, the chief solar deity in Hinduism; Surya is also known by the Sanskrit-language synonym Martand (मार्तण्ड, Mārtaṇḍa). The temple was destroyed by Sikandar Shah Miri.",
          "history":"According to Kalhana, the Martand Sun Temple was commissioned by Lalitaditya Muktapida in the eighth century CE.According to Jonaraja (fl. 1430) as well as Hasan Ali, the temple was destroyed by Sikandar Shah Miri (1389-1413) in a zeal to Islamise the society under the advice of Sufi preacher Mir Muhammad Hamadani; Jonaraja pinned the blame on his chief-counsel Suhabhatta, A Brahman neo-convert who was held to have manifested a reign of intense persecution for the local Hindus whereas Ali particularly affirmed Sikandar's own convictions in these aspects.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d13269.098646413695!2d75.20535190910742!3d33.75356767233105!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38e21029a5f074a5%3A0xe2b002f95f1a2b27!2sAncient%20Martand%20Surya%20Temple!5e0!3m2!1sen!2sin!4v1742472704970!5m2!1sen!2sin",
          "district":"Anantnag",
          "website":"https://www.incredibleindia.gov.in/en/jammu-and-kashmir/anantnag/martand-sun-temple",
          "image":"/1206.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        },
        {
          "t_id": 1207,
          "name":"Shankaracharya Temple",
          "text": "Shankaracharya Temple or Jyeshteshwara Temple is a Hindu temple situated on top of the Zabarwan Range in Srinagar in the union territory of Jammu and Kashmir. It is dedicated to Shiva. The temple is at a height of 1,000 feet (300 m) above the valley floor and overlooks the city of Srinagar. The temple is accessible via a road that emerges off Boulevard road near Gagribal.",
          "history":"The structure is considered as the oldest temple in Kashmir, historically and traditionally. It is situated on a hill that is a well preserved Panjal trap formed by volcanic activity during the Permian period. There is no consensus with regard to an exact date of construction. The earliest historical reference to the hill comes from Kalhana. He called the mountain 'Gopadri' or 'Gopa Hill'. Kalhana says that King Gopaditya granted the land at the foot of the hill to the Brahmins that had come from the 'Aryadesa'. The land grant, an agraharam, was called 'Gopa Agraharas'. This area at the base is now called Gupkar. Kalhana mentions another village in the vicinity of the hill where King Gopaditya housed some of the Brahmins to a village next door in present-day Dalgate. Kalhana also mentions that King Gopaditya built the temple on the top of the hill as a shrine to Jyesthesvara (Shiva Jyestharuda) around 371 BCE.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3304.63297135836!2d74.84114917571765!3d34.07892177314688!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38e18f6f3f8716df%3A0x778e120d6489acda!2sShri%20Adi%20Shankaracharya%20Temple%2C%20Srinagar!5e0!3m2!1sen!2sin!4v1742472876294!5m2!1sen!2sin" ,
          "district":"Srinagar",
          "website":"https://www.jktdc.co.in/info.aspx?id=91",
          "image":"/1207.jpg",
          "state": "Jammu and Kashmir",
          "country": "India"
        }
      ]
    },

    { "id": 13, "name": "Jharkhand" },
    { "id": 14, "name": "Karnataka" },
    { "id": 15, "name": "Kerala" },
    { "id": 16, "name": "Madhya Pradesh" },
    { "id": 17, "name": "Maharashtra" },

    { 
      "id": 18, 
      "name": "Manipur",
      "temples":[
        {
          "t_id": 1801,
          "name":"Gopinath Temple, Ningthoukhong",
          "text": "Gopinath Temple, located in Ningthoukhong, Manipur, is a significant Vaishnav Hindu temple dedicated to Lord Gopinath (Krishna). It holds the distinction of being the second-largest temple in Manipur.",
          "history":"The temple was built during the period when Vaishnavism became widely accepted in Manipur, primarily under the influence of King Garibaniwaz (Pamheiba) in the 18th century. The spread of Gaudiya Vaishnavism in Manipur, inspired by Sri Chaitanya Mahaprabhu, played a crucial role in the temple's construction and prominence. Ningthoukhong, where the temple is located, was a significant site for Meitei kings, and the temple was established as a center for Krishna devotion in the region.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3628.4695887908842!2d93.76442577427066!3d24.572985056702628!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3749333b922ac555%3A0xfb143e709c0a3d14!2sGopinath%20temple!5e0!3m2!1sen!2sin!4v1742466865037!5m2!1sen!2sin" ,
          "district":"Bishnupur",
          "website":"https://templesofindia.org/temple-view/gopinath-temple-bishnupur-manipur-706pzr",
          "image":"/1801.jpg",
          "state": "Manipur",
          "country": "India"
        },
        {
          "t_id": 1802,
          "name":"Shree Govindajee Temple",
          "text": "Shree Govindajee Temple is a Meitei Hindu temple, dedicated to Hindu deities Radha Krishna (Govindaji). It is the largest Vaishnava temple in Imphal district of Manipur, India. It was originally built in 1846 during the reign of Maharaja Nara Singh and later rebuilt by Maharaja Chandrakriti in 1876.",
          "history":"Maharaja Nara Singh (1844-50 AD) of the Manipur kingdom commissioned the temple on 16 January 1846 and dedicated it to Shree Govindaji, which was their royal deity. The temple and the deities were substantially damaged during an earthquake of 1868. Consequently, the temple was rebuilt to its original design during the reign of Maharaja Chandrakriti (1859-1886) and was consecrated on 26 April 1876. However, during the Anglo Manipur war of 1891 the idols of the temple were moved to Kongma. In 1908, after the Maharaja Churchand Singh took up residence at his new palace the idols were also moved and reconsecrated in the present temple.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3621.7388643506047!2d93.91911777536912!3d24.804393877966!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x37492634a728ade3%3A0x6dfa434c7a615318!2sShri%20Bijoy%20Govindajee%20Temple%2C%20Imphal!5e0!3m2!1sen!2sin!4v1742467273805!5m2!1sen!2sin" ,
          "district":"Imphal East",
          "website":"https://www.thetoptours.com/asia/india/manipur/imphal/shree-govindajee-temple",
          "image":"/1802.jpg",
          "state": "Manipur",
          "country": "India"
        }
      ]
    },

    { 
      "id": 19, 
      "name": "Meghalaya",
      "temples":[
        {
          "t_id":"1901",
          "name":"Nartiang Durga Temple",
          "text": "Nartiang Durga Temple is a 600-year-old temple located in the West Jaintia Hills district of Meghalaya in northeastern India. It is one of the 51 Shakti Peethas and is one of the holiest sites for devotees of the Shaktism sect of Hinduism. The Hindus in the Jaintia Hills of Meghalaya believes that this temple is the permanent abode of Goddess Durga. The temple draws a large number of pilgrims from all over the country on occasion of Durga Puja. The Shakti of Nartiang Devi shrine is worshipped as Jayanti and the Bhairava as Kamadishwar.",
          "history":"Devi's left thigh is believed to have fallen at Nartiang in the Jaintia Hills. Hence the Goddess is known as Jainteshwari. The Jaintia king Jaso Manik (1606–1641) had married Lakshmi Narayana, the daughter of the Hindu Koch king Nara Narayana. It is believed that it was Lakshmi Narayana who had influenced the Jaintia Royalty to embrace Hinduism. King Dhan Manik had made Nartiang the summer capital of the Jaintia Kingdom about 600 years ago. One night, the goddess appeared to him in a dream and informed him of the significance of the place and asked him to build a temple in Her honour. Following this, the Jainteshwari temple in Nartiang was established. The strategic location of the temple and presence of weapons like cannons suggests that the temple must have been part of a fort of the Jaintia Kings.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3599.1323259556098!2d92.20913417539393!3d25.567263977474607!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x37500beeef881617%3A0xe19abe26d695cb9a!2sShri%20Nartiang%20Durga%20Temple!5e0!3m2!1sen!2sin!4v1742210164228!5m2!1sen!2sin",
          "district":"West Jaintia Hills district",
          "website":"https://www.meghalayatourism.in/destinations/nartiang-durga-temple/",
          "image":"/1901.jpg",
          "state":"Meghalaya",
          "country":"India"
        }
      ]
    },

    { "id": 20, "name": "Odisha" },
    { "id": 21, "name": "Punjab" },
    { "id": 22, "name": "Rajasthan" },

    { 
      "id": 23, 
      "name": "Sikkim",
      "temples":[
        {
          "t_id":2301,
          "name":"Hanuman Tok",
          "text": "Hanuman Tok is a Hindu temple complex which is located in the upper reaches of Gangtok, the capital of the Indian state of Sikkim. The temple is dedicated to lord Hanuman, and maintained by the Indian army. It was established in 1952.",
          "history":"when Hanuman was flying with the “Sanjeevani”( mythological life saving herb) mountain to save Rama's brother Lakshmana he rested in the spot where his temple now lies for some time. The mandir is actually managed by The Indian Army. Tok means a temple, so it's a temple of Lord Hanuman.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3543.8923189204747!2d88.62612107545465!3d27.347834776390446!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39e6a5514bc70b5d%3A0x9d760d69eb35b763!2sHanuman%20Tok!5e0!3m2!1sen!2sin!4v1742215877699!5m2!1sen!2sin" ,
          "district":"Gangtok",
          "website":"https://www.tourmyindia.com/states/sikkim/hanuman-tok.html",
          "image":"/2301.jpg",
          "state":"Sikkim",
          "country":"India"
        },
        {
          "t_id":2302,
          "name":"Kirateshwar Mahadev Temple",
          "text": "Kirateshwar Mahadev Temple is a Hindu temple, identified to be a Hindu pilgrimage site which is located at Legship, Gyalshing district, India along the banks of River Rangeet, which has many episodes of the Mahabharata attached to it. The temple is also known as Kirateshwar Mahadev Thaan by the Kirati people or simply known as Shiv Mandir.",
          "history":"According to Hindu beliefs, pleased with Arjuna's hard penance and devotion, Lord Shiva appeared before him in the very spot where the temple lies as hunter Kirateshwar or Lord of the Kiratas and blessed him with success in the Mahabharat War. Long time ago as the people found miraculously existed a stone manifesting Shiva Ling. The said Shiv Ling is the main effigy of worship. Belief of many that a mere visit with true devotion to this temple fulfills one's wishes particularly a wish for son or daughter and also wishes for peace harmony and good health.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3546.1346107578684!2d88.27332017545221!3d27.277657976431506!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39e68467d299692b%3A0x2bcec31505cd1006!2sKirateshwar%20Mahadev%20Temple%2C%20Legship!5e0!3m2!1sen!2sin!4v1742216172480!5m2!1sen!2sin",
          "district":"Gyalshing",
          "website":"https://www.tourmyindia.com/states/sikkim/kirateshwar-mahadev-mandir.html",
          "image":"/2302.jpg",
          "state":"Sikkim",
          "country":"India"
        },
        {
          "t_id":2303,
          "name":"Thakurbari Temple",
          "text": "Thakurbari Temple is a Hindu temple located in Gangtok, Sikkim, India, in the heart of the town. It is one of the oldest Hindu temples in Sikkim built on land donated by the erstwhile Chogyal of Sikkim in 1935. The temple houses almost all major deities and has emerged as an important center of convergence for the Hindu community of Gangtok.",
          "history":"It was established in 1935 as a tiny temple on land granted by the former Chogyal of Sikkim. Following that, between 1945 and 1947, the temple was developed to a significant temple complex. The temple has practically all of the major deities and has developed as an important point of convergence for Gangtok’s Hindu population. The temple complex was expanded in 2011 to incorporate a multipurpose hall and a library.On a huge scale, the temple arranges several festivals and social gatherings. These festivities attract a great number of visitors and tourists from all over the world. Visitors gather here to worship the Lord and to accept his blessings.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3544.459404152358!2d88.61062707545403!3d27.33010247640097!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39e6a5156a192b2f%3A0x7ed8b74770beddbf!2sShri%20Thakurbari%20Temple%2C%20Gangtok!5e0!3m2!1sen!2sin!4v1742216571570!5m2!1sen!2sin",
          "district":"Gangtok",
          "website":"https://sikkimtourism.org/thakurbari-temple-gangtok/",
          "image":"/2303.jpeg",
          "state":"Sikkim",
          "country":"India"
        }
      ]
    },

    { "id": 24, "name": "Tamil Nadu" },
    { "id": 25, "name": "Telangana" },

    { 
      "id": 26,
      "name": "Tripura",
      "temples":[
        {
          "t_id": 2601,
          "name":"Agartala Jagannath Mandir",
          "text": "Jagannath Temple is a Hindu temple located within the Ujjayanta Palace grounds in Agartala, Tripura, India. Built by the Maharaja of Tripura of the Manikya Dynasty in the 19th century, the Jagannath temple is situated in the Ujjayanta Palace grounds and is dedicated to the Hindu Gods Jagannath, Balabhadra and Subhadra.",
          "history":"Built in the 19th century by then Maharaja of Tripura, Maharaja Radha Kishore Manikya, this temple with an octagonal base has four stories. The temple is adorned with bright orange stepped up Shikharas",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d1480.2345048174611!2d91.2798885!3d23.8362757!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3753f40e1abe419f%3A0x2dfb8c5bdf5a1fe9!2sShri%20Jagannath%20Temple%2C%20Agartala!5e1!3m2!1sen!2sin!4v1742210454962!5m2!1sen!2sin",
          "district":"West Tripura",
          "website":"https://www.holidify.com/places/agartala/jagannath-temple-sightseeing-1004.html",
          "image":"/2601.jpg",
          "state":"Tripura",
          "country":"India"
        },
        {
          "t_id": 2602,
          "name":"Chaturdasha Temple",
          "text": "Chaturdasha Temple is a Hindu temple in Agartala, Tripura, India, and features the Tripuri dome patterned after the roofs of village huts in Tripura. The dome is surmounted by a stupa-like structure which reveals traces of Buddhist influence. This temple was built in honour of fourteen deities, together called the Chaturdasha Devata. Devotees visit the temple for the kharchi festival.",
          "history":"The temple is fondly called the Chaudda Devata Mandir. The fourteen deities worshipped at the Chaturdasha temple Tripura are called Burasa, Lampra, Bikhatra, Akhatra, Thumnairok, Sangroma, Bonirok, Twima, Songram, Mwtaikotor, Mailuma, Noksumwtai, Swkalmwtai and Khuluma in Kokborok. These deities are the local forms of Hindu Gods and Goddesses who are Brahma, Vishnu, Shiva, Durga, Lakshmi, Kartikeya, Saraswati, Ganesha, Samudra, Prithvi, Agni, Ganga, Himadri and Kamadeva respectively. These deities and the Gods represented here have completely influenced the people of this state which is called the Country of Fourteen Gods and Goddesses. People from the neighboring states also come here in large numbers every year to pray for peace, happiness and prosperity.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3649.3570901926078!2d91.34262127533871!3d23.841450378608386!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3753f222cfc90691%3A0xa2d6517bea797f18!2sFourteen%20Gods&#39;%20and%20Goddesses&#39;%20Temple!5e0!3m2!1sen!2sin!4v1742210971091!5m2!1sen!2sin",
          "district":"West Tripura",
          "website":"https://www.templepurohit.com/hindu-temple/chaturdasha-temple-tripura/",
          "image":"/2602.jpg",
          "state":"Tripura",
          "country":"India"
        },
        {
          "t_id": 2603,
          "name":"Lakshmi Narayan Temple",
          "text": "Lakshmi Narayan Temple is a Hindu temple, dedicated to the Hindu divine couple Lakshmi Narayana, is located in the Ujjayanta Palace ground in the city of Agartala, Tripura state, India. It was founded by the King of Tripura, Birendra Kishore Manikya, during his reign from 1909 to 1923.",
          "history":"The temple was constructed by the King of Tripura, Birendra Kishore Manikya (r. 1909–1923), a century ago",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3649.5582182319336!2d91.28108487533852!3d23.83430377861328!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3753f505a37d2d6f%3A0xad080893d73c807f!2sShri%20Laxmi%20Narayan%20Temple%2C%20Agartala!5e0!3m2!1sen!2sin!4v1742211287883!5m2!1sen!2sin",
          "district":"West Tripura",
          "website":"https://www.pilgrimaide.com/blog/Lakshmi-Narayan-Temple-Agartala?srsltid=AfmBOorIhGll8yugjheWh3lXJhNbQ0AKgEM8_hAuKdWa0HdEqRlZ7H2o",
          "image":"/2603.jpeg",
          "state":"Tripura",
          "country":"India"
        },
        {
          "t_id": 2604,
          "name":"Tripura Sundari Temple",
          "text": "Tripura Sundari Temple is a Hindu temple of the Goddess Tripura Sundari, better known locally as Devi Tripureshwari the third mahavidya & main form of Parvati. The temple is situated in the ancient city of Udaipur, about 55 km from Agartala, Tripura and can be reached by train and road from Agartala. It is believed to be one of the holiest Hindu shrines in this part of the country and witnesses the highest number of visitors for a temple in North-East India, after Kamakhya Temple in Assam. The state of Tripura is named after this temple. Popularly known as Matabari, the shrine is set upon a small hillock that resembles the hump of a tortoise (Kurma). This shape called Kurmapṛṣṭhākṛti is considered the holiest possible site for a Shakti temple, hence also bestowing the name of Kurma Pīṭha. The Goddess is served by traditional Brahmin priests.",
          "history":"Legend has it that King Dhanya Manikya, who ruled over Tripura in the closing years of the 15th century, had a revelation one night in a dream in which Goddess Tripura Sundari instructed him to initiate her worship on the hilltop near the town of Udaipur, the contemporary capital of the kingdom. The king found out that a temple on the hillock was already dedicated to Lord Vishnu. He was in a dilemma, unable to decide how a temple dedicated to Vishnu could have an idol of Shakti. The following night, the divine vision was repeated. The king understood that Vishnu and Shakti were different forms of the same Supreme Deity (Brahman). Thus, the temple of Tripura Sundari came into being around the year 1501 CE. In the dawn of this century, the temple has crossed 500 years. This legend is recounted as an example of solidarity between two sub-groups of Hinduism: the Vaishnava and the Shakta sects.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15596246.460931713!2d60.016117649999956!3d17.379251500000006!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bcb9780383ebf5f%3A0x75f3183865284386!2sTripura%20sundari%20temple!5e0!3m2!1sen!2sin!4v1742211547778!5m2!1sen!2sin",
          "district":"Gomati",
          "website":"https://tripurasundari.tripura.gov.in/",
          "image":"/2604.jpeg",
          "state":"Tripura",
          "country":"India"
        },
        {
          "t_id": 2605,
          "name":"Unakoti",
          "text": "Unakoti famously known as Angkor Wat of the North-East, is a sculptural emblem and ancient Shaivite place that hosts rock carvings, figures and images of gods and goddesses. The bas relief sculptures at Unakoti are on stylistic grounds ascribed to 7th to 9th Century CE, to the period of Pre- Manikya rule. The rock art was patronized by Deva Dynasty of Sri Bhumi in Samatata. The only inscription at Unakoti is on the other Chaturmukhalinga image, consisting of a couple of records in Bengali Characters of the 11th to 12th Century CE, which mentions one SriJayadeva, probably a pilgrim.",
          "history":"According to Hindu scriptures, Lord Shiva once spent a night here en route to Kashi. 99,99,999 gods and goddesses followed him. He had asked his followers to wake up before sunrise and make their way towards Kashi. Unfortunately, none awoke, except Lord Shiva himself. Before he set out for Kashi alone, he put a curse on the others, turning them to stone and that is how the site got its name.",
          "iframeURL":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3635.90500021029!2d92.0649769253535!3d24.31494857828942!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x37518dc2868e1c8d%3A0xdd22a2c23c93985c!2sUnakoti%20place!5e0!3m2!1sen!2sin!4v1742211863474!5m2!1sen!2sin",
          "district":"Unakoti",
          "website":"https://unakoti.nic.in/tourist-place/unakoti-heritage-site/",
          "image":"/2605.jpg",
          "state":"Tripura",
          "country":"India"
        }
      ]
    },

    { "id": 27, "name": "Uttar Pradesh" },
    { "id": 28, "name": "Uttarakhand" },
    { "id": 29, "name": "West Bengal" }
  ]
  